export const data = [
  {
    region: "กรุงเทพและปริมณฑล",
    stateName: [
      {
        state: "กรุงเทพมหานคร",
      },
      {
        state: "นครปฐม",
      },
      {
        state: "นนทบุรี",
      },
      {
        state: "ปทุมธานี",
      },
      {
        state: "สมุทรปราการ",
      },
      {
        state: "สมุทรสงคราม",
      },
      {
        state: "สมุทรสาคร",
      },
    ],
  },
  {
    region: "ภาคกลาง",
    stateName: [
      {
        state: "สิงห์บุรี",
      },
      {
        state: "อ่างทอง",
      },
      {
        state: "พระนครศรีอยุธยา",
      },
      {
        state: "ลพบุรี",
      },
      {
        state: "สระบุรี",
      },
      {
        state: "ฉะเชิงเทรา",
      },
      {
        state: "ระยอง",
      },
      {
        state: "จันทบุรี",
      },
      {
        state: "ตราด",
      },
      {
        state: "นนทบุรี",
      },
      {
        state: "สมุทรสาคร",
      },
      {
        state: "สมุทรสงคราม",
      },
      {
        state: "นครปฐม",
      },
      {
        state: "สุพรรณบุรี",
      },
      {
        state: "กาญจนบุรี",
      },
      {
        state: "ราชบุรี",
      },
      {
        state: "เพชรบุรี",
      },
      {
        state: "ประจวบคิริขันธ์",
      },
    ],
  },
  {
    region: "ภาคตะวันออกเฉียงเหนือ",
    stateName: [
      {
        state: "อุดรธานี",
      },
      {
        state: "หนองบัวลำภู",
      },
      {
        state: "เลย",
      },
      {
        state: "หนองคาย",
      },
      {
        state: "บึงกาฬ",
      },
      {
        state: "สกลนคร",
      },
      {
        state: "นครพนม",
      },
      {
        state: "มุกดาหาร",
      },
      {
        state: "ขอนแก่น",
      },
      {
        state: "มหาสารคาม",
      },
      {
        state: "ร้อยเอ็ด",
      },
      {
        state: "กาฬสินธุ์",
      },
      {
        state: "นครราชสีมา",
      },
      {
        state: "ชัยภูมิ",
      },
      {
        state: "บุรีรัมย์",
      },
      {
        state: "สุรินทร์",
      },
      {
        state: "ศรีสะเกษ",
      },
      {
        state: "อุบลราชธานี",
      },
      {
        state: "ยโสธร",
      },
      {
        state: "อำนาจเจริญ",
      },
    ],
  },
  {
    region: "ภาคเหนือ",
    stateName: [
      {
        state: "กำแพงเพชร",
      },
      {
        state: "เชียงราย",
      },
      {
        state: "เชียงใหม่",
      },
      {
        state: "ตาก",
      },
      {
        state: "นครสวรรค์",
      },
      {
        state: "น่าน",
      },
      {
        state: "พะเยา",
      },
      {
        state: "พิจิตร",
      },
      {
        state: "พิษณุโลก",
      },
      {
        state: "เพชรบูรณ์",
      },
      {
        state: "แม่ฮ่องสอน",
      },
      {
        state: "ลำปาง",
      },
      {
        state: "ลำพูน",
      },
      {
        state: "สุโขทัย",
      },
      {
        state: "อุตรดิตถ์",
      },
      {
        state: "อุทัยธานี",
      },
    ],
  },
  {
    region: "ภาคใต้",
    stateName: [
      {
        state: "นราธิวาส",
      },
      {
        state: "ปัตตานี",
      },
      {
        state: "ยะลา",
      },
      {
        state: "สงขลา",
      },
      {
        state: "พัทลุง",
      },
      {
        state: "สตูล",
      },
      {
        state: "นครศรีธรรมราช",
      },
      {
        state: "ตรัง",
      },
      {
        state: "กระบี่",
      },
      {
        state: "ภูเก็ต",
      },
      {
        state: "พังงา",
      },
      {
        state: "สุราษฏร์ธานี",
      },
      {
        state: "ชุมพร",
      },
      {
        state: "ระนอง",
      },
    ],
  },
];

export const residences = [
  {
    value: "กรุงเทพและปริมณฑล",
    label: "กรุงเทพและปริมณฑล",
    children: [
      {
        value: "กรุงเทพมหานคร",
        label: "กรุงเทพมหานคร",
      },
      {
        value: "นครปฐม",
        label: "นครปฐม",
      },
      {
        value: "นนทบุรี",
        label: "นนทบุรี",
      },
      {
        value: "ปทุมธานี",
        label: "ปทุมธานี",
      },
      {
        value: "สมุทรปราการ",
        label: "สมุทรปราการ",
      },
      {
        value: "สมุทรสงคราม",
        label: "สมุทรสงคราม",
      },
      {
        value: "สมุทรสาคร",
        label: "สมุทรสาคร",
      },
    ],
  },
  {
    value: "ภาคกลาง",
    label: "ภาคกลาง",
    children: [
      {
        value: "สิงห์บุรี",
        label: "สิงห์บุรี",
      },
      {
        value: "อ่างทอง",
        label: "อ่างทอง",
      },
      {
        value: "พระนครศรีอยุธยา",
        label: "พระนครศรีอยุธยา",
      },
      {
        value: "ลพบุรี",
        label: "ลพบุรี",
      },
      {
        value: "สระบุรี",
        label: "สระบุรี",
      },
      {
        value: "ฉะเชิงเทรา",
        label: "ฉะเชิงเทรา",
      },
      {
        value: "ระยอง",
        label: "ระยอง",
      },
      {
        value: "จันทบุรี",
        label: "จันทบุรี",
      },
      {
        value: "ตราด",
        label: "ตราด",
      },
      {
        value: "นนทบุรี",
        label: "นนทบุรี",
      },
      {
        value: "สมุทรสาคร",
        label: "สมุทรสาคร",
      },
      {
        value: "สมุทรสงคราม",
        label: "สมุทรสงคราม",
      },
      {
        value: "นครปฐม",
        label: "นครปฐม",
      },
      {
        value: "สุพรรณบุรี",
        label: "สุพรรณบุรี",
      },
      {
        value: "กาญจนบุรี",
        label: "กาญจนบุรี",
      },
      {
        value: "ราชบุรี",
        label: "ราชบุรี",
      },
      {
        value: "เพชรบุรี",
        label: "เพชรบุรี",
      },
      {
        value: "ประจวบคิริขันธ์",
        label: "ประจวบคิริขันธ์",
      },
    ],
  },
  {
    value: "ภาคตะวันออกเฉียงเหนือ",
    label: "ภาคตะวันออกเฉียงเหนือ",
    children: [
      {
        value: "อุดรธานี",
        label: "อุดรธานี",
      },
      {
        value: "อ่างทอง",
        label: "อ่างทอง",
      },
      {
        value: "หนองบัวลำภู",
        label: "หนองบัวลำภู",
      },
      {
        value: "เลย",
        label: "เลย",
      },
      {
        value: "หนองคาย",
        label: "หนองคาย",
      },
      {
        value: "บึงกาฬ",
        label: "บึงกาฬ",
      },
      {
        value: "สกลนคร",
        label: "สกลนคร",
      },
      {
        value: "นครพนม",
        label: "นครพนม",
      },
      {
        value: "มุกดาหาร",
        label: "มุกดาหาร",
      },
      {
        value: "ขอนแก่น",
        label: "ขอนแก่น",
      },
      {
        value: "มหาสารคาม",
        label: "มหาสารคาม",
      },
      {
        value: "ร้อยเอ็ด",
        label: "ร้อยเอ็ด",
      },
      {
        value: "กาฬสินธุ์",
        label: "กาฬสินธุ์",
      },
      {
        value: "นครราชสีมา",
        label: "นครราชสีมา",
      },
      {
        value: "ชัยภูมิ",
        label: "ชัยภูมิ",
      },
      {
        value: "บุรีรัมย์",
        label: "บุรีรัมย์",
      },
      {
        value: "สุรินทร์",
        label: "สุรินทร์",
      },
      {
        value: "ศรีสะเกษ",
        label: "ศรีสะเกษ",
      },
      {
        value: "อุบลราชธานี",
        label: "อุบลราชธานี",
      },
      {
        value: "ยโสธร",
        label: "ยโสธร",
      },
      {
        value: "อำนาจเจริญ",
        label: "อำนาจเจริญ",
      },
    ],
  },
  {
    value: "ภาคเหนือ",
    label: "ภาคเหนือ",
    children: [
      {
        value: "กำแพงเพชร",
        label: "กำแพงเพชร",
      },
      {
        value: "เชียงราย",
        label: "เชียงราย",
      },
      {
        value: "เชียงใหม่",
        label: "เชียงใหม่",
      },
      {
        value: "ตาก",
        label: "ตาก",
      },
      {
        value: "นครสวรรค์",
        label: "นครสวรรค์",
      },
      {
        value: "น่าน",
        label: "น่าน",
      },
      {
        value: "พิจิตร",
        label: "พิจิตร",
      },
      {
        value: "พิษณุโลก",
        label: "พิษณุโลก",
      },
      {
        value: "เพชรบูรณ์",
        label: "เพชรบูรณ์",
      },
      {
        value: "แม่ฮ่องสอน",
        label: "แม่ฮ่องสอน",
      },
      {
        value: "ลำปาง",
        label: "ลำปาง",
      },
      {
        value: "ลำพูน",
        label: "ลำพูน",
      },
      {
        value: "สุโขทัย",
        label: "สุโขทัย",
      },
      {
        value: "อุตรดิตถ์",
        label: "อุตรดิตถ์",
      },
      {
        value: "อุทัยธานี",
        label: "อุทัยธานี",
      },
    ],
  },
  {
    value: "ภาคใต้",
    label: "ภาคใต้",
    children: [
      {
        value: "นราธิวาส",
        label: "นราธิวาส",
      },
      {
        value: "ปัตตานี",
        label: "ปัตตานี",
      },
      {
        value: "ยะลา",
        label: "ยะลา",
      },
      {
        value: "สงขลา",
        label: "สงขลา",
      },
      {
        value: "พัทลุง",
        label: "พัทลุง",
      },
      {
        value: "สตูล",
        label: "สตูล",
      },
      {
        value: "นครศรีธรรมราช",
        label: "นครศรีธรรมราช",
      },
      {
        value: "ตรัง",
        label: "ตรัง",
      },
      {
        value: "กระบี่",
        label: "กระบี่",
      },
      {
        value: "ภูเก็ต",
        label: "ภูเก็ต",
      },
      {
        value: "พังงา",
        label: "พังงา",
      },
      {
        value: "สุราษฏร์ธานี",
        label: "สุราษฏร์ธานี",
      },
      {
        value: "ชุมพร",
        label: "ชุมพร",
      },
      {
        value: "ระนอง",
        label: "ระนอง",
      },
    ],
  },
];

export const shopName = [
  "7-11",
  "แมคโคร",
  "บิ๊กซี",
  "มินิ บิ๊กซี",
  "โลตัส",
  "โลตัส โก เฟรซ",
  "ซี.เจ.",
  "เอ็กซ์เพรส",
  "เดอะมอลล์",
];
