import React, { useState } from "react";
import { Modal, Button } from "antd";

export default function ActivityPrivacy({ onAccept, onReject,isChecked}) {
  const [showModal, setShowModal] = useState(false);

  const handleReject = () => {

    if (onReject) {
      onReject();
    }
    setShowModal(false);
  };

  const handleAccept = () => {
    if (onAccept) {
      onAccept();
    }
    setShowModal(false);
  };

  return (
    <>
      <button
        className="text-slate-500 underline  active:bg-pink-600  text-sm  outline-none focus:outline-none mr-1 mb-1 ease-linear transition-all duration-150"
        type="button"
        onClick={() => setShowModal(true)}
      >
        ยอมรับเงื่อนไขและกติกาการร่วมกิจกรรม
      </button>
      {showModal ? (
        <Modal
          title="ข้อตกลงและเงื่อนไข"
          visible={showModal}
          onCancel={() => setShowModal(false)}
          className="flex items-center justify-center" // เพิ่มคุณสมบัติ flex และ justify-center
          centered
          footer={[
            <Button key="reject" onClick={handleReject} className="bg-black text-white">
              ปฏิเสธ
            </Button>,
            <Button key="accept" type="primary" className="bg-black text-white" onClick={handleAccept} value={isChecked} >
              ยอมรับ
            </Button>,
          ]}
        >
          <div className="relative p-6 flex flex-col space-y-2 overflow-y-scroll h-[300px] whitespace-normal">
            <h2>กติกาการร่วมสนุก กิจกรรม “คูลคูลเฟรช บิ๊กอั่งเปา”</h2>
            <h3 className="text-decoration-line: underline">
              ของรางวัล แบ่งออกเป็น 2 ส่วน
            </h3>
            <p className="my-4 text-blueGray-500 text-sm leading-relaxed">
              โปรดอ่านข้อตกลงและเงื่อนไขร่วมกิจกรรมส่งภาพใบเสร็จลุ้นรับของรางวัล
              ใช้งานผ่านเว็บแอปพลิเคชันนี้ ("ข้อตกลงและเงื่อนไข")
              อย่างระมัดระวังเนื่องจากข้อตกลงและเงื่อนไขนี้ระบุถึงข้อมูลสำคัญเกี่ยวกับ
              สิทธิและหน้าที่ต่างๆ ของท่าน รวมถึงข้อจำกัดและข้อยกเว้นต่างๆ
              ซึ่งมีผลในการทำธุรกรรมและกิจกรรม ทั้งหมดบนเว็บแอปพลิเคชัน
            </p>
            <p>
              ส่วนที่ 1
              รางวัลสำหรับผู้โชคดีที่ร่วมกิจกรรมส่งใบเสร็จจากห้างบิ๊กซี, มินิ
              บิ๊กซี,โลตัส, โลตัส โก เฟรช, ซี.เจ. เอ็กซ์เพรสและเดอะมอลล์ หรือ
              กูร์เมต์ มาร์เก็ต จำนวน 32 รางวัล
            </p>
            <p>
              รางวัลที่ 1 ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 2 รางวัล
              (รางวัลละ 2 ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า 200,000 บาท
            </p>
            <p>
              รางวัลที่ 2 สร้อยคอทองคำหนัก 1 สลึง จำนวน 30 รางวัล รางวัลละ 8,838
              บาท (รวมค่ากำเหน็จ) รวมมูลค่า 265,140 บาท (หมายเหตุ :
              ราคาทองรูปพรรณ ณ วันที่ 29 พ.ย. 2566)
            </p>
            <p>
              ส่วนที่ 2
              รางวัลสำหรับผู้โชคดีที่ร่วมกิจกรรมส่งใบเสร็จจากห้างแม็คโคร จำนวน
              21 รางวัล
            </p>
            <p>
              รางวัลที่ 1 ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 1 รางวัล
              (รางวัลละ 2 ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า 100,000 บาท
            </p>
            <p>
              รางวัลที่ 2 สร้อยคอทองคำหนัก 1 สลึง จำนวน 20 รางวัล รางวัลละ 8,838
              บาท (รวมค่ากำเหน็จ) รวมมูลค่า 176,760 บาท (หมายเหตุ :
              ราคาทองรูปพรรณ ณ วันที่ 29 พ.ย. 2566) รวมมูลค่าของรางวัลทั้งสิ้น
              741,900 บาท(เจ็ดแสนสี่หมื่นหนึ่งพันเก้าร้อยบาทถ้วน)
            </p>

            <h3 className="text-decoration-line: underline">
              วิธีการลงทะเบียนร่วมกิจกรรม
            </h3>
            <p>
              ผู้ร่วมกิจกรรมสามารถซื้อผลิตภัณฑ์คูลคูลเฟรช ขนาด 280 มล.
              ที่ร่วมรายการ รสชาติก็ได้จาก 6 รสชาติ ได้แก่
              คูลคูลเฟรชน้ำผึ้งมะนาว, น้ำเก๊กฮวย, น้ำอัญชันมะนาว, น้ำอ้อย,
              น้ำมะพร้าว ผสมวุ้นมะพร้าว, น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว
              แล้วลงทะเบียนเข้าร่วมกิจกรรมผ่านทางระบบเว็บแอปพลิเคชันคูลคูลเฟรช
              บิ๊กอั่งเปา กรอกข้อมูล แล้วทำการอัพโหลดใบเสร็จ
              (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะใบเสร็จที่มียอดซื้อ ตั้งแต่วันที่
              15 ม.ค.67 ถึง 29 ก.พ.67 ที่ได้รับ ณ จุดแคชเชียร์จากห้าง
              ที่ระบุและตามระยะเวลาที่กำหนดเท่านั้น
              ส่วนใบเสร็จจากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถร่วม
              ในกิจกรรมนี้ได้) พร้อมเขียนชื่อ-นามสกุล, เบอร์โทรศัพท์ ลงบนใบเสร็จ
              ที่มีการซื้อสินค้าที่ร่วมรายการและส่งเข้าร่วม กิจกรรมได้
              ตั้งแต่วันที่ 15 มกราคม 2567 ถึง 29 กุมภาพันธ์ 2567
              ผ่านระบบเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา เพื่อส่งลุ้นรางวัล
              ตามเงื่อนไขการรับสิทธิ์ดังนี้
            </p>
            <p>
              1. สำหรับผู้ร่วมกิจกรรมที่ซื้อสินค้าคูลคูลเฟรชจากห้างบิ๊กซี, มินิ
              บิ๊กซี, โลตัส, โลตัสโก เฟรช, ซี.เจ. เอ็กซ์เพรส และเดอะมอลล์หรือ
              กูร์เมต์ มาร์เก็ต สาขาใดก็ได้ ตามเงื่อนไขที่ระบุด้านล่าง ได้แก่
            </p>
            <p>
              - เมื่อซื้อผลิตภัณฑ์คูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
              รสชาติใดก็ได้จาก 6รสชาติ ได้แก่ น้ำผึ้งมะนาว,
              น้ำเก๊กฮวย,น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าวผสมวุ้นมะพร้าว,
              น้ำมะพร้าวใบเตยผสมวุ้นมะพร้าว ครบทุกๆ 2 ขวด จะได้รับ 1
              สิทธิ์เพื่อลุ้นรางวัล พร้อมเขียนชื่อ-นามสกุล, เบอร์โทรศัทพ์
              ลงบนใบเสร็จ(ไม่จำกัดจำนวนการซื้อต่อ 1 ใบเสร็จ)
              (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะใบเสร็จที่มียอดซื้อ ตั้งแต่วันที่
              15 ม.ค.67 ถึง 29 ก.พ.67 ที่ได้รับ ณ
              จุดแคชเชียร์จากห้างที่ระบุและตามระยะเวลาที่กำหนดเท่านั้นส่วนใบเสร็จจากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถร่วมในกิจกรรมนี้ได้)
              (กรณีซื้อเป็นจำนวนคี่ เช่น 3, 5, 7, 9 ขวด
              ทางบริษัทจะตัดตามสิทธิ์ในเงื่อนไขซื้อครบทุก 2 ขวดได้รับ 1 สิทธิ์)
            </p>
            <p>
              2.
              สำหรับผู้ร่วมกิจกรรมที่ซื้อสินค้าคูลคูลเฟรชจากห้างแม็คโครสาขาใดก็ได้ตามเงื่อนไขที่ระบุด้านล่าง
              ได้แก่
            </p>
            <p>
              - เมื่อซื้อผลิตภัณฑ์คูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
              รสชาติใดก็ได้จาก 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว,
              น้ำเก๊กฮวย,น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว ผสมวุ้นมะพร้าว,
              น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว ครบทุกๆ 2 แพ็ค (1 แพ็คมี 6 ขวด)
              จะได้รับ 1 สิทธิ์เพื่อลุ้นรางวัล พร้อมเขียนชื่อ-นามสกุล,
              เบอร์โทรศัทพ์ ลงบนใบเสร็จ (ไม่จำกัดจำนวนการซื้อต่อ 1 ใบเสร็จ)
              (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะใบเสร็จที่มียอดซื้อ ตั้งแต่วันที่
              15 ม.ค.67ถึง 29 ก.พ.67 ที่ได้รับ ณ
              จุดแคชเชียร์จากห้างที่ระบุและตามระยะเวลาที่กำหนดเท่านั้นส่วนใบเสร็จจากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถร่วมในกิจกรรมนี้ได้)
            </p>
            <p>
              - เมื่อซื้อผลิตภัณฑ์คูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
              รสชาติใดก็ได้จาก 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว, น้ำเก๊กฮวย,
              น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว ผสมวุ้นมะพร้าว,
              น้ำมะพร้าวใบเตยผสมวุ้นมะพร้าว จากแม็คโครยกลัง(1 ลัง บรรจุ 8 แพ็ค
              ใน 1 แพ็คมี 6 ขวด) จะได้รับ 4
              สิทธิ์เพื่อลุ้นรางวัลพร้อมเขียนชื่อ-นามสกุล, เบอร์โทรศัทพ์
              ลงบนใบเสร็จ (ไม่จำกัดจำนวนการซื้อต่อ 1 ใบเสร็จ)
              (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะใบเสร็จที่มียอดซื้อ ตั้งแต่วันที่
              15 ม.ค.67 ถึง29 ก.พ.67 ที่ได้รับ ณ
              จุดแคชเชียร์จากห้างที่ระบุและตามระยะเวลาที่กำหนดเท่านั้นส่วนใบเสร็จจากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถร่วมในกิจกรรมนี้ได้)
            </p>

            <h3 className="text-decoration-line: underline">วิธีร่วมกิจกรรม</h3>
            <p>
              ผู้ร่วมกิจกรรมลงทะเบียนผ่านทางระบบเว็บแอปพลิเคชัน
              สามารถสแกนเข้าร่วมกิจกรรมผ่านทาง QR Code,
              หรือกดเข้าร่วมกิจกรรมแคมเปญคูลคูลเฟรช บิ๊กอั่งเปา ได้ที่ลิ้งก์
              https://koolkoolfreshcampaign2024.com ผ่านสื่อโฆษณาออนไลน์
              หรือสื่อโฆษณา ณ จุดขาย หรือพิมพ์ค้นหา Line ID : @katothailand
              เพื่อเข้าถึงลิงค์กิจกรรมและทำการลงทะเบียนกรอก ชื่อ-นามสกุล,
              เบอร์โทร, วันเดือนปีเกิด, เพศ
              ข้อมูลต้องเป็นข้อมูลจริงที่สามารถติดต่อได้
              และต้องกดยอดรับนโยบายข้อมูล ส่วนบุคคล กดยอมรับเงื่อนไขกิจกรรม
              และทำการอัพโหลดภาพใบเสร็จ (ซึ่งต้องเขียนชื่อ-นามสกุล,
              เบอร์โทรศัทพ์ ลงบนใบเสร็จ กำกับไว้), ช่องทางการซื้อสินค้า,
              และจังหวัดที่ซื้อสินค้า
              โดยทางเจ้าหน้าที่จะมีการตรวจสอบความถูกต้องของใบเสร็จ
              เพื่ออนุมัติสิทธิ์ให้ผู้ร่วมกิจกรรมลุ้นโชคภายใน 24
              ชั่วโมงของวันถัดไป ผู้ร่วมกิจกรรมสามารถตรวจสอบสถานะใบเสร็จได้
              จากระบบเว็บแอปพลิเคชัน
              ในกรณีที่ซื้อสินค้าครบและถูกต้องตามเงื่อนไขกติกา
              ระบบจะขึ้นสถานะคำว่า “ถูกต้อง”
              หากมีการลงทะเบียนซ้ำโดยใช้ใบเสร็จเดิม จะมีขึ้นข้อความ “ใบเสร็จซ้ำ”
              หากซื้อสินค้าไม่ถูกต้องตามเงื่อนไขกติกา จะมี ขึ้นข้อความ
              “ซื้อไม่เข้าเงื่อนไข” กรณีรายการใบเสร็จอยู่ในระหว่างการตรวจสอบ
              จะมีขึ้นข้อความ “รอการตรวจสอบ”
              และกรณีที่กิจกรรมได้สิ้นสุดลงแล้วจะไม่สามารถลงทะเบียนร่วมกิจกรรมได้
              โดยทางผู้ร่วมกิจกรรมต้องเก็บใบเสร็จตัวจริง
              (ที่มีเขียนชื่อ-นามสกุล, เบอร์โทรศัทพ์ ระบุไว้)
              เป็นหลักฐานในสภาพที่สมบูรณ์ ห้ามดัดแปลง หรือทุจริต
              หรือทำให้ใบเสร็จ มีสภาพที่ไม่สมบูรณ์ ฉีกขาด
              มองไม่เห็นข้อมูลที่ชัดเจน โดย 1 ใบเสร็จสามารถลงทะเบียนได้ 1 ครั้ง
              และไม่จำกัดจำนวนสิทธิ์ ของการซื้อสินค้าในแต่ละใบเสร็จ
              ตามเงื่อนไขการรับสิทธิ์ที่ได้กำหนดไว้ในกติกา
              ซึ่งทางเจ้าหน้าที่จะทำการตรวจสอบ ใบเสร็จทุกใบ
              และกดอนุมัติสิทธิ์ตามจำนวนการซื้อสินค้าที่ถูกต้องตามเงื่อนไขและกติกา
              กรณีผู้ร่วมกิจกรรมลงทะเบียน อัพโหลดโดยใช้ใบเสร็จเดิมซ้ำอีกครั้ง
              หรือซื้อไม่ตรงตามเงื่อนไขและกติกา ทางเจ้าหน้าที่จะไม่อนุมัติสิทธิ์
              ซึ่งผู้ร่วมกิจกรรมสามารถตรวจเช็คสถานะการตรวจสอบใบเสร็จได้ ภายใน 24
              ชม. ของวันถัดไป โดยระบบเปิดให้เริ่มลงทะเบียนได้ตั้งแต่ วันที่ 15
              มกราคม 2567 ถึงวันที่ 29 กุมภาพันธ์ 2567
              และกรณีที่ลงทะเบียนหลังระยะเวลากิจกรรมสิ้นสุดลงแล้ว จะมีข้อความ
              แจ้งที่ระบบว่า “กิจกรรมเริ่มวันที่ 15 มกราคม 2567 ถึงวันที่ 29
              กุมภาพันธ์ 2567 ตอนนี้กิจกรรมได้สิ้นสุดแล้ว” ที่หน้าระบบ
            </p>
            <p>
              เมื่อกิจกรรมสิ้นสุด จะนำชื่อ-นามสกุล หมายเลขโทรศัพท์
              และเลขที่ใบเสร็จ ที่ลงทะเบียนมาทั้งหมดนำมาการจับรางวัล
            </p>
            <p>โดยแบ่งการจับรางวัลดังนี้</p>
            <p>
              ส่วนที่ 1 รางวัลสำหรับผู้โชคดีที่ร่วมกิจกรรมจากห้างบิ๊กซี, มินิ
              บิ๊กซี, โลตัส, โลตัส โก เฟรช, ซี.เจ. เอ็กซ์เพรส และเดอะมอลล์ หรือ
              กูร์เมต์ มาร์เก็ต จำนวน 32 รางวัล
            </p>
            <p>
              รางวัลที่ 1 ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 2 รางวัล
              (รางวัลละ 2 ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า 200,000 บาท
            </p>
            <p>
              รางวัลที่ 2 สร้อยคอทองคำหนัก 1 สลึง จำนวน 30 รางวัล รางวัลละ 8,838
              บาท (รวมค่ากำเหน็จ) รวมมูลค่า 265,140 บาท
            </p>
            <p>
              ส่วนที่ 2 รางวัลสำหรับผู้โชคดีที่ร่วมกิจกรรมจากห้างแม็คโคร จำนวน
              21 รางวัล
            </p>
            <p>
              รางวัลที่ 1 ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 1 รางวัล
              (รางวัลละ 2 ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า
            </p>
            <p>
              รางวัลที่ 2 สร้อยคอทองคำหนัก 1 สลึง จำนวน 20 รางวัล รางวัลละ 8,838
              บาท (รวมค่ากำเหน็จ) รวมมูลค่า 176,760 บาท (หมายเหตุ :
              ราคาทองรูปพรรณ ณ วันที่ 29 พ.ย. 2566) รวมมูลค่าของรางวัลทั้งสิ้น
              741,900 บาท(เจ็ดแสนสี่หมื่นหนึ่งพันเก้าร้อยบาทถ้วน)
            </p>
            <h3 className="text-decoration-line: underline">
              กำหนดการณ์ต่าง ๆ
            </h3>
            <table>
              <thead className="text-center">
                <tr>
                  <th className="text-sm">วันลงทะเบียนร่วมกิจกรรม</th>
                  <th className="text-sm">วันจับรางวัล</th>
                  <th className="text-sm">วันประกาศรายชื่อผู้โชคดี</th>
                  <th className="text-sm">วันแจกรางวัล</th>
                </tr>
              </thead>
              <tbody className="text-center">
                <tr>
                  <td className="border">
                    วันที่ 15 มกราคม 2567 ถึง วันที่ 29 กุมภาพันธ์ 2567
                  </td>
                  <td className="border text-xs">วันที่ 8 มีนาคม 2567</td>
                  <td className="border text-xs">วันที่ 13 มีนาคม 2567</td>
                  <td className="border text-xs">วันที่ 29 มีนาคม 2567</td>
                </tr>
              </tbody>
            </table>

            <h3 className="text-decoration-line: underline">
              เงื่อนไขในการจับและรับรางวัล
            </h3>
            <p>
              1. บริษัทฯ จะจัดพิมพ์ ชื่อ-นามสกุล หมายเลขโทรศัพท์
              และเลขที่ใบเสร็จของผู้ร่วมรายการลงบนกระดาษตามจำนวนสิทธิ์
              ที่ลงทะเบียนถูกต้องและสำเร็จ ตัดเป็นชิ้นส่วน
              แล้วรวบรวมชิ้นส่วนทั้งหมดมาจับรางวัล 2 กอง ซึ่งแบ่งกองฉลากดังนี้
              กองที่ 1 สำหรับผู้ที่ส่งใบเสร็จร่วมกิจกรรมจากห้างบิ๊กซี, มินิ
              บิ๊กซี, โลตัส, โลตัส โก เฟรช, ซี.เจ. เอ็กซ์เพรส และเดอะมอลล์ หรือ
              กูร์เมต์ มาร์เก็ต นำมาจับรางวัล อันได้แก่ รางวัลที่ 1
              ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 2 รางวัล (รางวัลละ 2
              ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า 200,000 บาท รางวัลที่ 2
              สร้อยคอทองคำหนัก 1 สลึง จำนวน 30 รางวัล รางวัลละ 8,838 บาท
              (รวมค่ากำเหน็จ) รวมมูลค่า 265,140 บาท กองที่ 2
              สำหรับผู้ที่ส่งใบเสร็จร่วมกิจกรรมจากห้างแม็คโคร อันได้แก่
            </p>
            <p>
              รางวัลที่ 1 ทริปท่องเที่ยวแพ็กเกจทัวร์ฮ่องกง จำนวน 1 รางวัล
              (รางวัลละ 2 ที่นั่ง) รางวัลละ 100,000 บาท รวมมูลค่า 100,000 บาท
              และ รางวัลที่ 2 สร้อยคอทองคำหนัก 1 สลึง จำนวน 20 รางวัล รางวัลละ
              8,838 บาท (รวมค่ากำเหน็จ) รวมมูลค่า 176,760 บาท (หมายเหตุ :
              ราคาทองรูปพรรณ ณ วันที่ 29 พ.ย. 2566) และ
              โดยใช้วิธีโยนขึ้นบนอากาศและเชิญผู้ทรงคุณวุฒิที่น่าเชื่อถือ
              แขกผู้มีเกียรติจับชิ้นส่วนต่อหน้าคณะกรรมการและสักขีพยานเพื่อให้ได้รางวัลตามที่กำหนดไว้
            </p>
            <p>
              2. บริษัทฯ จะทำการจับรางวัล ณ
              สำนักงานพัฒนาวิทยาศาสตร์และเทคโนโลยีแห่งชาติ ( สวทช.) เลขที่ 111
              อุทยานวิทยาศาสตร์ประเทศไทย ถ.พหลโยธิน ต.คลองหนึ่ง อ.คลองหลวง
              จ.ปทุมธานี 12120 โดยจะทำการจับรางวัล เวลา 14.00 น. ของวันที่ 8
              มีนาคม 2567
            </p>
            <p>
              3. เมื่อจับรางวัลเรียบร้อยแล้ว บริษัท โมบาย คอนเน็ค จำกัด
              (ตัวแทนของบริษัททวีผล ผลิตภัณฑ์ จำกัด)
              จะทำการตรวจสอบและติดต่อกลับไปยังผู้โชคดีที่ได้รับรางวัลตามข้อมูลใบเสร็จที่ได้ลงทะเบียนร่วมกิจกรรม
              เพื่อแจ้งรายละเอียดในการรับรางวัลต่อไป หากไม่สามารถติดต่อได้
              จะดึงรายชื่อลำดับสำรองขึ้นมาแทน
              (ลำดับสำรองเรียงตามลำดับตอนจับรางวัล)
            </p>
            <p>
              4.
              บริษัทฯจะประกาศเบอร์โทรศัพท์และเลขที่ใบเสร็จของผู้ที่ได้รับรางวัลผ่านทาง
              Facebook Kool Kool Fresh :
              https://www.facebook.com/KoolKoolFreshHerbalDrink และผ่านระบบ
              Microsite : https://koolkoolfreshcampaign2024.com ของวันที่ 13
              มีนาคม 2567 เวลา 16.00 น หรือสอบถามเพิ่มเติมได้ที่ เบอร์
              097-1853583 (ในวันจันทร์ – ศุกร์เวลา 08.30 – 17.30 น.)
            </p>
            <p>
              5. หลังจากที่ประกาศผล เบอร์โทรศัพท์
              และเลขที่ใบเสร็จของผู้โชคดีแล้วหากผู้โชคดีไม่ติดต่อหรือไม่ยืนยันตัวตนกลับภายใน
              30 วันจากวันที่ประกาศผลถือว่าผู้โชคดีได้สละสิทธิ์
              หลังจากนั้นทางบริษัทฯ
              จะให้สิทธิ์การได้รับรางวัลแก่ผู้ที่ได้รางวัลสำรองลำดับถัดไป
            </p>
            <p>
              6. บริษัทฯ
              จะมอบรางวัลแก่ผู้โชคดีหลังจากประกาศหมายเลขโทรศัพท์และเลขที่ใบเสร็จผู้โชคดีแล้ว
              ผู้โชคดีที่ได้รับรางวัลจะต้องมารับรางวัลด้วยตัวเองหรือมอบอำนาจให้ผู้อื่นมารับรางวัล
              ณ บริษัทโมบาย คอนเน็ค จํากัด (สํานักงานใหญ่)1111/84 ถนนลาดพร้าว
              แขวงจันทรเกษม เขตจตุจักร กรุงเทพฯ 10900 วันที่ 29 มีนาคม 2567
            </p>
            <p>
              7.
              ผู้โชคดีที่ได้รับรางวัลต้องมาติดต่อขอรับของรางวัลโดยจะต้องนำบัตรประจำตัวประชาชน
              หรือบัตรข้าราชการตัวจริง,สำเนาทะเบียนบ้าน,
              ใบเสร็จตัวจริงที่มีเลขที่และมีข้อมูลตรงกับฉลากที่จับและอยู่ในสภาพสมบูรณ์
              โดยต้องไม่มีการดัดแปลง แก้ไข ทำซ้ำรอยตัวพิมพ์เดิม หรือทำการใด ๆ
              เพื่อให้ได้มาโดยมิชอบซึ่งจะถือเป็นโมฆะและไม่มีสิทธิ์รับรางวัลหากหลักฐานไม่ครบ
              ทางบริษัทฯ จะมอบรางวัลดังกล่าวให้กับรายชื่อสำรองลำดับถัดไป
            </p>
            <p>
              7.1 กรณีเป็นเด็กที่อายุต่ำกว่า 18 ปี
              ต้องมีสำเนาสูติบัตรหรือสำเนาบัตรประชน(ถ้ามี)
              และสำเนาบัตรประชาชนของผู้ปกครองมาแสดงด้วย
            </p>
            <p>
              7.2 กรณีมอบอำนาจ ให้ทำหนังสือมอบอำนาจ ติดอากรแสตมป์ 10 บาท
              สำเนาบัตรประชาชนของผู้ที่ได้รับรางวัล
              พร้อมใบเสร็จตัวจริงและนำสำเนาบัตรประชาชนของผู้รับมอบอำนาจโดยเอกสารที่ใช้ได้แก่สำเนาทะเบียนบ้าน,แนบมาด้วย
              กรณีไม่สามารถมารับของรางวัลได้ด้วยตนเองสามารถมอบอำนาจได้สูงสุด 1
              คนต่อ 1 รางวัล
            </p>
            <p>
              8. พนักงาน และครอบครัว ของ พนักงานบริษัท ทวีผล ผลิตภัณฑ์ จำกัด
              และบริษัทตัวแทนโฆษณา รวมถึงบริษัทที่เกี่ยวข้องกับการจัดกิจกรรม
              ไม่มีสิทธิ์เข้าร่วมรายการนี้
            </p>
            <p>
              9. ตลอดระยะเวลาการร่วมกิจกรรม ผู้โชคดีที่ได้รับรางวัลมากกว่า 1
              รางวัลจะมีสิทธิ์ได้รับรางวัลที่มีมูลค่าสูงสุดได้เพียงรางวัลเดียวเท่านั้น
              โดยของรางวัลไม่สามารถแลกเปลี่ยนเป็นเงินสดหรือสิ่งของอื่นใดได้
              และไม่สามารถโอนสิทธิ์ให้ผู้อื่นได้
            </p>
            <p>
              10. บริษัทฯ
              ขอสงวนสิทธิ์ในการจับรางวัลสำรองในกรณีที่ผู้โชคดีมีคุณสมบัติไม่ครบถ้วนในการขอรับรางวัล
              และไม่สามารถมาติดต่อเพื่อรับรางวัลได้ภายในระยะเวลาที่ทางบริษัทฯ
              กำหนดไว้
            </p>
            <p>
              11. ผู้โชคดีที่ได้รับรางวัลต้องชำระภาษี ณ ที่จ่าย 5%
              ของมูลค่าของรางวัลตั้งแต่ 1,000 บาท เป็นต้นไปตามคำสั่งกรมสรรพากร
              ที่ ทป. 4/2528 ลงวันที่ 26 กันยายน 2528ประกอบคำสั่งกรมสรรพากร ที่
              ท.ป. 104/2544 ลงวันที่ 15 กันยายน 2544
            </p>
            <p>
              12. ผลการจับรางวัลและคำตัดสินของ บริษัท ทวีผล ผลิตภัณฑ์ จำกัด
              ถือเป็นเด็ดขาดและสิ้นสุด
            </p>
            <p>
              13. บริษัทฯ
              ถือว่าผู้ร่วมกิจกรรมทุกรายในช่วงระยะเวลาการจัดกิจกรรมส่งเสริมการขายนี้
              ได้ตกลงยอมรับข้อกำหนดตามกติกาและเงื่อนไขของการร่วมกิจกรรมชิงรางวัลนี้ทุกประการ
            </p>
            <p>
              14.
              ผู้โชคดีที่ได้รับรางวัลอนุญาตให้ทีมงานฯบันทึกภาพการเข้าร่วมกิจกรรมทุกขั้นตอน
              พร้อมทั้งอนุญาตให้บริษัททวีผล ผลิตภัณฑ์ จำกัด นำชื่อ-นามสกุล
              เบอร์โทรศัพท์และรายละเอียดอื่นใดของลูกค้าผู้ได้รับรางวัลรวมถึงภาพถ่ายของผู้ที่ได้รับรางวัล
              ออกเผยแพร่เพื่อการประชาสัมพันธ์ได้ในสื่อทุกชนิดโดยไม่มีค่าตอบแทนใดๆทั้งสิ้น
              ไม่ว่าจะประกอบอาชีพใดๆ และไม่ต้องแจ้งให้ทราบล่วงหน้า
            </p>
            <p>
              15.
              กิจกรรมนี้เฉพาะผู้ที่มีสัญชาติไทยและพำนักอาศัยอยู่ในประเทศไทยเท่านั้น
            </p>
            <p>
              16. ผู้ที่ลงทะเบียนเข้าร่วมกิจกรรม
              ถือว่าได้อ่านรายละเอียดข้อตกลงเงื่อนไขของการร่วมกิจกรรมแล้ว
              ไม่สามารถปรับเปลี่ยนได้ หรือเรียกร้องให้ปรับแก้ไขกติกาได้
            </p>
            <p>
              17.
              บริษัทฯถือว่าผู้ร่วมกิจกรรมทุกรายที่เข้าร่วมรายการระหว่างระยะเวลาการจัดกิจกรรมส่งเสริมการขายนี้
              ได้ตกลงยอมรับข้อกำหนดตามกติกาและเงื่อนไขของการเข้าร่วมและการจับรางวัลนี้ทุกประการ
            </p>
            <p>
              18.
              ผู้โชคดีสำหรับรางวัลทริปแพ็คเกจทัวร์ฮ่องกงจะต้องมีหนังสือเดินทางที่มีอายุคงเหลือมากกว่า
              6 เดือนก่อนวันเดินทางและพร้อมเดินทางในเดือน เมษายน 2567
              และหากผู้โชคดีที่มีอายุต่ำกว่า 18ปี
              ต้องมีผู้ปกครองร่วมเดินทางมีเอกสารยินยอมจากผู้ปกครอง
            </p>
            <p>
              19.
              ผู้โชคดีและผู้ร่วมเดินทางทริปแพ็กเกจทัวร์ฮ่องกงต้องรับผิดชอบในการทำหนังสือเดินทาง
              (passport)
              ด้วยตนเองและหากผู้โชคดีดังกล่าวไม่สามารถเดินทางตามวันเวลาที่กำหนดได้ให้ถือว่าผู้โชคดีสละสิทธิ์ในการรับรางวัลดังกล่าวโปรแกรมการเดินทางนี้ไม่รวมค่าวีซ่าประเทศ,
              ทิปคนขับ+ไกด์,ไม่รวมค่าตรวจ RT-PCR,
              ค่าอาหารและเครื่องดื่มที่สั่งพิเศษในร้านอาหาร
              นอกจากบริษัทที่ดูทัวร์จัดให้หรือค่าใช้จ่ายพิเศษที่นอกเหนือจากโปรแกรมการท่องเที่ยวที่บริษัททัวร์กำหนดในกรณีที่ผู้ได้รับรางวัลไม่ผ่านการอนุมัติให้เข้าประเทศ
              (ไม่ผ่านวีซ่า) บริษัทฯขอสงวนสิทธิ์ในการรับผิดชอบใด ๆ ทั้งสิ้น
              และรวมถึงการแลกเปลี่ยนรางวัลเป็นเงินสดหรือการเคลมในทุกกรณี
            </p>
            <p>
              20. ผู้โชคดีทริปแพ็กเกจทัวร์ฮ่องกง
              จะต้องเดินทางตามระยะเวลาที่บริษัทฯกำหนดโดยบริษัทฯ
              จะแจ้งกำหนดการเดินทางและข้อตกลงก่อนการเดินทางที่ชัดเจนให้ผู้โชคดีทราบในภายหลังและผู้โชคดีจะต้องแจ้งรายชื่อบุคคลที่จะได้ร่วมเดินทางไปด้วย
              1 ท่าน ภายใน 7 วัน หลังจากสิ้นสุดรายการส่งเสริมการขายนี้
            </p>
            <p>
              21.
              บริษัทฯเป็นเพียงผู้จัดรายการส่งเสริมการขายสำหรับลูกค้าเพื่อการท่องเที่ยวต่างประเทศซึ่งไม่อาจรับผิดชอบต่อการปฏิเสธการเข้าหรือออกประเทศของเจ้าหน้าที่ตรวจคนเข้าเมืองหรือออกเมืองอันเนื่องมาจากมีสิ่งผิดกฎหมายหรือเอกสารการเดินทางไม่ถูกต้อง
              หรือปฏิเสธในกรณีอื่น ๆ โดยมิใช่ความผิดชอบบริษัทฯ
              ให้ถือว่าผู้โชคดีทริปแพ็กเกจทัวร์ฮ่องกง
              สละสิทธิ์ในการรับของรางวัลดังกล่าว ทางบริษัท
              ฯขอสงวนสิทธิ์ในการชดเชย และรับผิดชอบในทุกกรณี
            </p>
            <p>
              22. บริษัท ทวีผลผลิตภัณฑ์ จำกัด เลขที่ 101 ถนนชักพระ
              แขวงคลองชักพระเขตตลิ่งชัน กรุงเทพฯ 10170 ได้ทำการว่าจ้างบริษัท
              โมบาย คอนเน็ค จำกัด เป็นผู้ดำเนินการเขียนโปรแกรมระบบ
              และบริการของเว็บแอปพลิเคชันคูลคูลเฟรช บิ๊กอั่งเปา
              และดูแลในการดำเนินการขออนุญาตรวมถึงงานจับรางวัลและติดต่อและมอบรางวัลแก่ผู้โชคดีรวมถึงจัดซื้อของรางวัล
              เป็นต้น ทั้งนี้บริษัท โมบาย คอนเน็ค
              จำกัดเป็นนิติบุคคลที่จัดตั้งขึ้นและคงอยู่ตามกฎหมายของประเทศไทย
              ที่ทำการอยู่ที่ บริษัท โมบาย คอนเน็ค จำกัด ที่ทำการอยู่ที่1111/84
              ถนนลาดพร้าว แขวงจันทรเกษมเขตจตุจักร กรุงเทพมหานคร 10900 ประเทศไทย
              ทางบริษัท ทวีผลผลิตภัณฑ์จำกัด ไม่มีส่วนเกี่ยวข้องในการรับผิดชอบ
              กรณีมีข้อผิดพลาดใด ๆ ทั้งสิ้นที่เกิดขึ้นการผู้รับจ้าง
            </p>
          </div>
        </Modal>
      ) : null}
    </>
  );
}
