import React, { useState } from "react";
import { Modal, Checkbox, Button } from "antd";

export default function PrivacyModal({ onAccept, onReject, isChecked }) {
  const [showModal, setShowModal] = useState(false);

  const handleAccept = () => {
    if (onAccept) {
      onAccept();
    }
    setShowModal(false);  
  };
  
  const handleReject = () => {
    if (onReject) {
      onReject();
    }
    setShowModal(false);
  };

  return (
    <>
      <button
        className="text-slate-500 underline text-sm outline-none focus:outline-none mr-1 mb-1 ease-linear transition-all duration-150"
        type="button"
        onClick={() => setShowModal(true)}
      >
        ยอมรับเงื่อนไข-นโยบายการให้ข้อมูลส่วนตัว
      </button>
      {showModal ? (
        <Modal
          title="ข้อตกลงและเงื่อนไข"
          visible={showModal}
          onCancel={() => setShowModal(false)}
          className="flex items-center justify-center" // เพิ่มคุณสมบัติ flex และ justify-center
          centered
          footer={[
            <Button key="reject" className="bg-black text-white" onClick={handleReject} >
              ปฏิเสธ
            </Button>,
            <Button key="accept" type="primary" className="bg-black text-white" value={isChecked} onClick={handleAccept}>
              ยอมรับ
            </Button>,
          ]}
        >
        <div className="relative p-6 flex flex-col space-y-2 overflow-y-scroll h-[350px] whitespace-normal">
                  <h2>
                    ข้อตกลงและเงื่อนไขของผู้ใช้งาน แคมเปญ : คูลคูลเฟรชบิ๊กอั่งเปา
                  </h2>
                  <p className="my-4 text-blueGray-500 leading-relaxed ">
                    โปรดอ่านข้อตกลงและเงื่อนไขร่วมกิจกรรมส่งภาพใบเสร็จลุ้นรับของรางวัล
                    ใช้งานผ่านเว็บแอปพลิเคชันนี้ ("ข้อตกลงและเงื่อนไข")
                    อย่างระมัดระวังเนื่องจากข้อตกลงและเงื่อนไขนี้ระบุถึงข้อมูลสำคัญเกี่ยวกับ
                    สิทธิและหน้าที่ต่างๆ ของท่าน รวมถึงข้อจำกัดและข้อยกเว้นต่างๆ
                    ซึ่งมีผลในการทำธุรกรรมและกิจกรรม ทั้งหมดบนเว็บแอปพลิเคชัน
                  </p>
                  <p>
                    การที่ท่านสมัครใช้บริการ และหรือ ใช้บริการใดๆ ผ่าน
                    เว็บแอปพลิเคชัน หรือโดยการเลือก "ตกลง"
                    เพื่อยอมรับตามข้อตกลงและเงื่อนไขนี้
                    ถือว่าท่านได้รับทราบและรับรู้ถึงเนื้อหาของข้อตกลงและเงื่อนไขนี้
                    โดยครบถ้วนสมบูรณ์แล้ว
                    และตกลงที่จะถูกผูกพันโดยข้อตกลงและเงื่อนไขนี้
                    รวมถึงกฎระเบียบและนโยบาย ที่อาจประกาศบนเว็บไซด์
                    และเว็บแอปพลิเคชันซึ่งอาจมีการแก้ไขได้เป็นครั้งคราวโดยไม่จำเป็นต้องแจ้งให้ทราบล่วงหน้า
                    นอกจากนี้ บริการบางอย่างที่เสนอให้ผู้ใช้บริการได้ใช้งาน
                    ผ่านเว็บไซต์หรือโปรแกรมอาจอยู่ภายใต้ข้อตกลงและเงื่อนไขเฉพาะเพิ่มเติม
                    ซึ่งการใช้บริการของท่าน
                    จะต้องอยู่ภายใต้ข้อตกลงและเงื่อนไขเพิ่มเติมดังกล่าวด้วย
                    โดยถือเป็นส่วนหนึ่งของข้อตกลงและ เงื่อนไขนี้โดยการอ้างอิง
                    นอกจากนี้ท่านตกลงว่าธุรกรรมอิเล็กทรอนิกส์/อินเทอร์เน็ต(Electronic/
                    internet
                    transactions)ที่ได้มีการประมวลผลและดำเนินการจนเสร็จสิ้นแล้วโดยผ่านทางเว็บไซต์
                    หรือโปรแกรมนี้มีผลบังคับใช้ได้อย่างสมบูรณ์ตามกฎหมายและผูกพันคู่สัญญาตามพระราชบัญญั
                    ติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์ พุทธศักราช 2544
                    ของประเทศไทย
                  </p>
                  <p>1.นิยามคำศัพท์</p>
                  <p>
                    1.1 "สัญญา" (Agreement) หรือ "ข้อตกลงและเงื่อนไข" (Terms and
                    Conditions) หมายถึงข้อตกลง และเงื่อนไขนี้
                  </p>
                  <p>
                    1.2 "โฆษณา" (Advertising) หรือ "การโฆษณา" (Ads) หมายถึง
                    โฆษณาที่สร้างโดยผู้สนับสนุนเพื่อ
                    ส่งเสริมการขายหรือเพื่อกิจกรรมการตลาดต่างๆ ของสินค้า หรือ
                    บริการของผู้สนับสนุนโดยผ่านเว็บไซต์
                  </p>
                  <p>
                    1.3 คูลคูลเฟรช บิ๊กอั่งเปา หมายถึง
                    เว็บแอปพลิเคชันที่ถูกสร้างขึ้นบนระบบปฏิบัติการแอนดรอยด์
                    (Android) ระบบปฏิบัติไอโอเอส (iOS) และ
                    ผ่านช่องทางระบบคอมพิวเตอร์ หรือระบบปฏิบัติการอื่นๆ
                    ที่อาจพัฒนาขึ้นในอนาคต
                    เป็นสื่อกลางให้ผู้สนับสนุนประกาศแคมเปญกิจกรรมการตลาดต่างๆ
                    กำหนดสิทธิ์การลุ้นรางวัล กำหนดเงื่อนไขและข้อกำหนด
                    รวมถึงการโฆษณาต่างๆ ให้กับผู้ใช้งาน (User)
                    ที่ยินยอมตกลงสมัครเป็นสมาชิก
                  </p>
                  <p>
                    1.4 "แคมเปญ" (Campaign) หมายถึง
                    กิจกรรมส่งเสริมการตลาดที่ผู้สนับสนุนประกาศลงบนเว็บไซต์
                    หรือโปรแกรมสำหรับให้ผู้ใช้งานร่วมกิจกรรม
                    หรือแลกรับของรางวัลได้ภายในระยะเวลาที่ผู้สนับสนุน
                    กำหนดภายใต้ข้อตกลงและเงื่อนไขของแต่ละแคมเปญ
                  </p>
                  <p>
                    1.5 "ผู้สนับสนุน" (Sponsor) หมายถึง
                    นิติบุคคลหรือบุคคลธรรมดาที่เป็นผู้สนับสนุนรางวัล
                    เป็นผู้สร้าง และประกาศแคมเปญกิจกรรมการตลาดต่างๆ
                    บนเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา ผู้ใช้งาน
                    ที่ตกลงยอมรับเงื่อนไขและข้อกำหนด การลุ้นรางวัล
                    อันได้แก่สินค้า (Product) บริการ (Service) บัตรกำนัล
                    (Voucher) คูปอง (Coupon) และ ของรางวัล เป็นต้น
                  </p>
                  <p>
                    1.6 "ระบบ" (System) หมายถึง
                    ฐานข้อมูลและโปรแกรมการทำงานของเว็บแอปพลิเคชัน คูลคูลเฟรช
                    บิ๊กอั่งเปา
                  </p>
                  <p>
                    1.7 "ธุรกรรม" (Transaction) หมายถึง การที่ผู้ใช้งาน (User)
                    ทำรายการลงทะเบียนข้อมูลส่วนบุคคล
                    สำหรับร่วมกิจกรรมบนเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    บนอุปกรณ์พกพา (Mobile Device) หรือ ผ่านคอมพิวเตอร์
                  </p>
                  <p>
                    1.8 "ผู้ใช้งาน" (User) หมายถึงท่านผู้ซึ่งเข้าชมและใช้งาน
                    รวมไปถึงการร่วมกิจกรรมต่างๆ บนเว็บ แอปพลิเคชัน (คูลคูลเฟรช
                    บิ๊กอั่งเปา)
                  </p>
                  <p>
                    1.9 สิทธิ์ หมายถึง สิทธิ์ที่ คูลคูลเฟรช บิ๊กอั่งเปา
                    เป็นผู้กำหนดในการได้มา เพื่อใช้ร่วมกิจกรรม ลุ้นรางวัล สินค้า
                    บริการ บัตรกำนัล คูปอง ที่ประกาศไว้
                  </p>

                  <p>2. บททั่วไป</p>
                  <p>
                    2.1
                    เอกสารนี้เป็นสัญญาตามกฎหมายระหว่างผู้ใช้งานกับผู้สนับสนุน
                  </p>
                  <p>
                    2.2
                    ผู้ใช้งานตกลงว่าเนื้อหาทั้งหมดที่ผู้ใช้งานเข้าถึงได้โดยการใช้งานบนเว็บแอปพลิเคชัน
                    นั้นถือเป็นความเสี่ยงภัยของผู้ใช้งานเอง
                    และผู้ใช้งานจะต้องรับผิดชอบในความเสียหายหรือสูญหายใดๆ
                    ที่เกิดขึ้นกับผู้ใช้งานหรือบุคคลอื่นอันเนื่องมาจากเนื้อหาดังกล่าว
                    อนึ่ง เพื่อวัตถุประสงค์ของข้อตกลง และเงื่อนไขนี้ คำว่า
                    "เนื้อหา"
                    ให้รวมถึงแต่ไม่จำกัดเพียงข้อมูลเกี่ยวกับสถานที่อยู่ วีดีโอ
                    ข้อความเสียง ข้อวิจารณ์ ข้อมูล ข้อความ รูปภาพ โปรแกรมต่างๆ
                    ที่ใช้กับคอมพิวเตอร์ สคริปท์ กราฟฟิก และสิ่งที่ใช้
                    ระหว่างกันอื่นใดที่ คูลคูลเฟรช บิ๊กอั่งเปา เป็นผู้สร้างขึ้น
                    จัดหา หรือทำให้เข้าถึงได้ผ่านทางบริการ
                  </p>
                  <p>
                    2.3 เนื้อหา หรือกิจกรรมใดๆ บนเว็บแอปพลิเคชัน คูลคูลเฟรช
                    บิ๊กอั่งเปา อาจมีการโฆษณา หรือจัดให้มี
                    การร่วมกิจกรรมกับผู้ใช้งานผ่านทางโปรแกรมของบุคคลที่สาม
                    เช่นเฟซบุ๊ก หรือช่องทางอื่นๆ ได้
                    ในกรณีที่เป็นการใช้งานโดยผ่านเว็บไซต์หรือโปรแกรมของบุคคลที่สาม
                    ผู้ใช้งานอาจถูกร้องขอให้ตกลง
                    และปฏิบัติตามข้อตกลงและเงื่อนไขในการใช้งานของบุคคลที่สามดังกล่าว
                  </p>

                  <p>3. บัญชี: การลงทะเบียนและการยกเลิก</p>
                  <p>
                    3.1 ผู้ใช้งานจะต้องลงทะเบียน
                    กดยอมรับเงื่อนไขและนโยบายส่วนบุคคล พร้อมกรอกข้อมูล,
                    ส่งรูปภาพ ใบเสร็จ ให้ถูกต้องและครบถ้วน
                    ซึ่งจะถือเป็นการลงทะเบียนสำเร็จ เพื่อที่จะมีสิทธิ์ลุ้นรางวัล
                    โดยสามารถ ตรวจสอบสถานะในการลุ้นรางวัลที่ประกาศไว้บน
                    เว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                  </p>
                  <p>
                    3.2 ในการลงทะเบียนเป็นผู้ใช้งาน ผู้ใช้งานจะต้องให้ข้อมูล
                    ชื่อ-นามสกุล อีเมล์ หมายเลขโทรศัพท์ ที่ยังใช้งานได้
                    หรือข้อมูลส่วนตัวอื่นๆ ที่เว็บแอปพลิเคชันกำหนด ทั้งนี้
                    โปรดดูรายละเอียดเพิ่มเติม ในหัวข้อ นโยบายความเป็นส่วนตัว
                  </p>
                  <p>
                    3.3 ผู้ใช้งานจะต้องสมัครลงทะเบียนร่วมกิจกรรม คูลคูลเฟรช
                    บิ๊กอั่งเปา กรอกข้อมูลส่วนตัวที่ใช้ใน
                    การสมัครเพื่อร่วมกิจกรรมส่งรูปภาพใบเสร็จในเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา โดยต้องเป็น ข้อมูลส่วนตัวจริง
                    และข้อมูลการติดต่อที่ยังใช้งานอยู่ในปัจจุบันเท่านั้น ทั้งนี้
                    เพื่อให้คูลคูลเฟรช บิ๊กอั่งเปา หรือผู้สนับสนุน
                    สามารถตรวจสอบยืนยันตัวบุคคลผู้ใช้งานในกรณีแลกรับของรางวัลต่างๆ
                    ได้ หากผู้ใช้งาน สมัครสมาชิกโดยใช้ข้อมูลของบุคคลอื่น
                    ผู้สนับสนุนมีสิทธิ์ในการขอตรวจสอบหลักฐานประกอบเพิ่มเติม
                    เพื่อยืนยันตัวตนว่าเป็นของเจ้าของข้อมูลจริง
                    หากไม่สามารถตรวจสอบข้อมูลได้ ผู้สนับสนุนขอสงวนสิทธิ์
                    ในการมอบของรางวัลแก่ผู้ใช้งาน
                    ไม่สามารถเป็นเปลี่ยนสิทธิ์ในการลุ้นรางวัลและไม่สามารถเปลี่ยน
                    เป็นเงินสดได้
                  </p>
                  <p>
                    {" "}
                    3.4 ผู้สนับสนุนขอสงวนสิทธิ์ที่จะปฏิเสธการสมัครสมาชิก
                    หรือยกเลิกบัญชีของสมาชิกเมื่อใดก็ได้
                    โดยไม่ต้องมีการแจ้งล่วงหน้า
                    ในกรณีที่สามารถตรวจสอบได้ว่าผู้ใช้งานบัญชีดังกล่าวทำการทุจริต
                    ส่อเจตนาทุจริต
                    หรือทำผิดกฏที่ประกาศไว้ในเงื่อนไขและข้อตกลงของแต่ละแคมเปญ
                    โดยสิทธิ์ที่ได้รับ
                    หรือสะสมไว้ของผู้ใช้งานจะถูกยกเลิกโดยอัตโนมัติ
                    และจะไม่มีการชดเชยคืนให้แก่ผู้ใช้งานไม่ว่า ในรูปแบบใดๆ
                    ทั้งสิ้น
                  </p>
                  <p>
                    3.5 บัญชีที่ลงทะเบียนร่วมกิจกรรม คูลคูลเฟรช บิ๊กอั่งเปา
                    ของผู้ใช้งานอาจถูกยกเลิกหาก ผู้สนับสนุน
                    พบว่าผู้ใช้งานประกาศหรือลงข้อความในลักษณะที่เป็นการละเมิดหรือก่อให้เกิดความเสียหายต่อ
                    สถาบันชาติ ศาสนาหรือพระมหากษัตริย์
                  </p>

                  <p>4. การได้รับสิทธิ์ลุ้นรางวัล</p>
                  <p>4.1 การได้รับสิทธิ์</p>
                  <p>
                    4.1.1
                    ผู้ใช้งานที่ลงทะเบียนจะได้รับสิทธิ์ในการลุ้นรางวัลตามเงื่อนไขที่ระบุในกติกา
                    เมื่อซื้อสินค้า คูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
                    รสชาติใดก็ได้ จากทั้ง 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว,
                    น้ำเก๊กฮวย, น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว
                    ผสมวุ้นมะพร้าว, น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว
                    พร้อมอัพโหลดใบเสร็จที่ได้จากการซื้อผลิตภัณฑ์เครื่องดื่มสมุนไพรคูลคูลเฟรชที่ร่วมกิจกรรมและการร่วม
                    กิจกรรมต่างๆ บนเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    รวมไปถึงกิจกรรมอื่นๆ ที่ผู้สนับสนุนเป็น ผู้กำหนดขึ้น
                    โดยผู้สนับสนุนจะเป็นผู้แจ้งกติกาการได้รับสิทธิ์ให้ทราบผ่านช่องทางต่างๆ
                    ของผู้สนับสนุนเอง
                    หรือผ่านช่องทางหรือเว็บไซต์ของบุคคลที่สามก็ได้ทั้งสิ้น
                  </p>
                  <p>โดยแบ่งออกเป็น 2 เงื่อนไข</p>
                  <p>
                    1.สำหรับผู้ร่วมกิจกรรมที่ส่งใบเสร็จจากห้างบิ๊กซี, มินิ
                    บิ๊กซี, โลตัส, โลตัส โก เฟรช, ซี.เจ. เอ็กซ์เพรส และเดอะมอลล์
                    หรือ กูร์เมต์ มาร์เก็ต
                  </p>
                  <p>
                    - เมื่อซื้อสินค้าคูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
                    รสชาติใดก็ได้ จากทั้ง 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว,
                    น้ำเก๊กฮวย, น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว
                    ผสมวุ้นมะพร้าว, น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว ครบทุกๆ 2 ขวด
                    ได้รับ 1 สิทธิ์เพื่อลุ้นรางวัล
                    (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะ ใบเสร็จที่มียอดซื้อ
                    ตั้งแต่วันที่ 15 ม.ค.67 ถึง 29 ก.พ.67 ที่ได้รับ ณ
                    จุดแคชเชียร์จากห้างที่ระบุและ ตามระยะเวลาที่กำหนดเท่านั้น
                    ส่วนใบเสร็จจากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถ
                    ร่วมในกิจกรรมนี้ได้) (กรณีซื้อเป็นจำนวนคี่ เช่น 3, 5, 7, 9
                    ขวด ทางบริษัทจะตัดตามสิทธิ์ในเงื่อนไข ซื้อครบทุก 2 ขวด
                    ได้รับ 1 สิทธิ์)
                  </p>
                  <p>2.สำหรับผู้ร่วมกิจกรรมที่ส่งใบเสร็จจากห้างแม็คโคร</p>
                  <p>
                    - เมื่อซื้อสินค้าสินค้าคูลคูลเฟรช ขนาด 280 มล. ที่ร่วมรายการ
                    รสชาติใดก็ได้ จากทั้ง 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว,
                    น้ำเก๊กฮวย, น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว
                    ผสมวุ้นมะพร้าว, น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว ครบทุกๆ 2
                    แพ็ค (1 แพ็คมี 6 ขวด) จะได้รับ 1 สิทธิ์เพื่อลุ้นรางวัล
                  </p>
                  <p>
                    - กรณีผู้ร่วมกิจกรรมซื้อสินค้าคูลคูลเฟรช ขนาด 280 มล.
                    ที่ร่วมรายการ รสชาติใดก็ได้ จากทั้ง 6 รสชาติ ได้แก่
                    น้ำผึ้งมะนาว, น้ำเก๊กฮวย, น้ำอัญชันมะนาว, น้ำอ้อย,
                    น้ำมะพร้าว ผสมวุ้นมะพร้าว, น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว
                    จากแม็คโครยกลัง (1 ลัง บรรจุ 8 แพ็ค ใน 1 แพ็ค มี 6 ขวด)
                    จะได้รับ 4 สิทธิ์ เพื่อลุ้นรางวัล
                    (ขอสงวนสิทธิ์การร่วมกิจกรรมเฉพาะใบเสร็จที่มียอดซื้อ
                    ตั้งแต่วันที่ 15 ม.ค.67 ถึง29 ก.พ.67 ที่ได้รับ ณ
                    จุดแคชเชียร์จากห้างที่ระบุและตามระยะเวลาที่กำหนดเท่านั้น
                    ส่วนใบเสร็จ
                    จากการซื้อผ่านช่องทางออนไลน์หรือเดลิเวอรี่ไม่สามารถร่วมในกิจกรรมนี้ได้)
                  </p>
                  <p>
                    4.1.2 สิทธิ์ที่ผู้ใช้งานได้รับสามารถนำไปใช้ลุ้นรับรางวัล
                    ภายใต้เงื่อนไขและกำหนดระยะเวลาของ
                    แต่ละแคมเปญที่มีการประกาศให้ทราบบนเว็บแอปพลิเคชันเท่านั้น
                    ผู้ใช้งานไม่สามารถโอนสิทธิ์ ให้แก่ผู้ใช้งานท่านอื่น
                    และไม่สามารถแลกเปลี่ยนสิทธิ์เป็นเงินสดได้ ไม่ว่ากรณีใดๆ
                  </p>
                  <p>
                    4.1.3
                    สิทธิ์ที่ได้รับมาจากการลงทะเบียนส่งรูปภาพใบเสร็จเข้ามาในระยะเวลากิจกรรมตั้งแต่วันที่
                    15 มกราคม 2567 ถึงวันที่ 29 กุมภาพันธ์ 2567
                    เท่านั้นและจะสิ้นสุดลงเมื่อกิจกรรมจบ เมื่อกิจกรรม
                    สิ้นสุดลงทางทีมงานจะดำเนินการปิดระบบเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา
                  </p>
                  <p>
                    4.1.4 ในกรณีที่เกิดการล้มเหลวของระบบอันเป็นผลทำให้ฐานข้อมูล
                    หรือสิทธิ์ที่สะสมไว้ของผู้ใช้งาน สูญหาย
                    ผู้สนับสนุนขอสงวนสิทธิ์ตัดสินการใดๆ ที่เกี่ยวกับจำนวนสิทธิ์
                    และการให้สิทธิ์ประโยชน์ต่างๆ บนเว็บแอปพลิเคชันคูลคูลเฟรช
                    บิ๊กอั่งเปา และผู้ใช้งานตกลงยอมรับคำตัดสินดังกล่าวโดยไม่มี
                    ข้อโต้แย้งใดๆ ทั้งสิ้น
                  </p>
                  <p>
                    4.1.5 ผู้สนับสนุนมีสิทธิในการปรับเปลี่ยนอัตรา
                    หรือจำนวนสิทธิ์ที่ผู้ใช้งานจะได้รับจากการส่งรูปภาพ
                    ใบเสร็จจากการซื้อผลิตภัณฑ์ คูลคูลเฟรช ขนาด 280 มล.
                    ที่ร่วมรายการ 6 รสชาติ ได้แก่ น้ำผึ้งมะนาว, น้ำเก๊กฮวย,
                    น้ำอัญชันมะนาว, น้ำอ้อย, น้ำมะพร้าว ผสมวุ้นมะพร้าว,
                    น้ำมะพร้าวใบเตย ผสมวุ้นมะพร้าว และการร่วมกิจกรรมต่างๆ ได้
                    โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                  </p>
                  <p>
                    4.1.6 ผู้สนับสนุน ขอสงวนสิทธิ์ในการรวมสิทธิ์ หรือ
                    ถ่ายโอนสิทธิ์ หรือ
                    เปลี่ยนแปลงจำนวนสิทธิ์จากบัญชีผู้ใช้งานหนึ่ง
                    ไปอีกบัญชีผู้ใช้งานหนึ่ง ไม่ว่ากรณีใดก็ตาม
                  </p>
                  <p>
                    4.1.7 ผู้ใช้งานที่ทำการสะสมสิทธิ์เข้าบัญชีผู้ใช้งาน
                    ไม่สามารถแลกเปลี่ยนเป็นเงินสด หรือของรางวัล อื่นได้
                    และไม่สามารถโอนสิทธิในการโอนจำนวนสิทธิ์ให้แก่บุคคลอื่นได้
                  </p>
                  <p>
                    4.1.8 ผู้ใช้งานผ่านระบบเว็บแอปพลิเคชัน คูลคูลเฟรช
                    บิ๊กอั่งเปา จำเป็นต้องลงทะเบียนและกรอกข้อมูล
                    ที่ถูกต้องและครบถ้วน และ กดยอมรับเงื่อนไขกติกาของกิจกรรม
                    และนโยบายข้อมูลส่วนบุคคล
                  </p>
                  <p>4.2 แคมเปญและการลุ้นรางวัล</p>
                  <p>
                    4.2.1
                    ผู้สนับสนุนจะเป็นผู้สร้างและประกาศแคมเปญลงบนเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา
                    เพื่อให้ผู้ใช้งานลุ้นรางวัลตามที่ผู้สนับสนุนกำหนด
                    ทั้งนี้แคมเปญแต่ละแคมเปญอาจมีข้อกำหนด หรือเงื่อนไขเฉพาะ
                    ดังนั้นจึงเป็นหน้าที่ของผู้ใช้งานในการศึกษาและทำความเข้าใจข้อกำหนด
                    และเงื่อนไขเฉพาะดังกล่าว
                    โดยจะไม่รับผิดชอบหากผู้ใช้งานเข้าใจผิดเกี่ยวกับเนื้อหาหรือข้อกำหนด
                    หรือเงื่อนไขของแคมเปญ
                  </p>
                  <p>
                    4.2.2 เมื่อผู้ใช้งานส่งคำขอ
                    และตกลงยอมรับข้อกำหนดและเงื่อนไขการแลกรับรางวัลแล้ว
                    จะไม่สามารถ ยกเลิกหรือเปลี่ยนแปลงได้
                    และจะไม่มีการคืนสิทธิ์ในการลุ้นรางวัลให้ไม่ว่าในกรณีหรือด้วยเหตุผลใดๆ
                    และขอสงวนสิทธิ์ในการปรับเปลี่ยน
                    หรือเปลี่ยนแปลงจำนวนสิทธิ์ในการลุ้นของรางวัล
                    หรือสิทธิ์ที่ใช้ ในการเข้าร่วมกิจกรรมต่างๆ บนเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา โดยไม่ต้องแจ้งให้ทราบล่วงหน้า
                  </p>
                  <p>
                    4.2.3
                    ผู้สนับสนุนมีสิทธิที่จะยกเลิกคำขอแลกรับรางวัลของผู้ใช้งานได้ไม่ว่าในเวลาใดๆ
                    อันเนื่องมาจาก
                    ความผิดพลาดอันเป็นผลให้ข้อมูลของแคมเปญถูกแสดงผิดไป
                    ในกรณีการยกเลิกคำขอแลกรับรางวัล ดังกล่าว
                    ผู้สนับสนุนจะคืนสิทธิ์ในการลุ้นรางวัลให้แก่ผู้ใช้งานเต็มจำนวน
                    ทั้งนี้จะไม่มีการคืนให้เป็นตัวเงิน ไม่ว่าในกรณีใดๆ
                  </p>
                  <p>4.3 การจับแจกและ จัดส่งรางวัล</p>
                  <p>
                    4.3.1 เมื่อระบบได้รับคำยืนยันการใส่รูปภาพใบเสร็จลุ้นรางวัล
                    ระบบจะทำการเก็บข้อมูลเลขที่ใบเสร็จ
                    และภาพใบเสร็จที่ลูกค้าอัพโหลดเมื่อกิจกรรมสิ้นสุดและมีการจับรางวัลแล้วทีมงานจะติดต่อผู้โชคดี
                    เพื่อนำส่งของรางวัลโดยรางวัลจะถูกจัดส่งให้แก่ผู้ใช้งานเฉพาะที่อยู่ภายในประเทศไทยเท่านั้น
                  </p>
                  <p>
                    4.3.2 ผู้สนับสนุนจะไม่รับประกันคุณภาพ ความปลอดภัย
                    หรือคุณลักษณะใดๆ ผลิตภัณฑ์ หรือสินค้า ที่มาจากบุคคลที่สาม
                    ที่ผู้ใช้งานแลกรับ เนื่องจากคุณภาพ ความปลอดภัย
                    หรือคุณลักษณะใดๆ ของผลิตภัณฑ์
                    หรือสินค้าดังกล่าวเป็นไปตามมาตรฐานที่บุคคลที่สามแจ้งไว้หากผลิตภัณฑ์
                    หรือสินค้า เกิดชำรุดบกพร่อง
                    ผู้ใช้งานจะต้องติดต่อศูนย์บริการของบุคคลที่สามที่เป็นผู้ผลิต
                    หรือผู้ให้บริการ ของผลิตภัณฑ์ หรือสินค้านั้นๆ เอง
                  </p>
                  <p>
                    4.4 ภาษีอากร
                    ธุรกรรมที่เกี่ยวเนื่องกับแคมเปญเป็นธุรกรรมโดยตรงระหว่างผู้สนับสนุนและผู้ใช้งานดังนั้น
                    ผู้ใช้งาน
                    รับทราบและตกลงว่าการรับรางวัลดังกล่าวอาจอยู่ภายใต้บังคับของกฏหมายภาษีอากรที่เกี่ยวข้อง
                    เช่น การหักภาษี ณ ที่จ่าย อากรแสตมป์ ภาษีมูลค่าเพิ่ม เป็นต้น
                  </p>
                  <p>
                    4.4.1 ผู้ที่ได้รับรางวัลมูลค่าเกิน 1,000 บาท ต้องชำระภาษีหัก
                    ณ ที่จ่าย 5% (ตามคำสั่งกรมสรรพกร ที่ ทป.101/2544)
                  </p>
                  <p>5. นโยบายความเป็นส่วนตัว</p>
                  <p>
                    ผู้สนับสนุน เคารพในสิทธิความเป็นส่วนตัวของผู้ใช้งานทุกคน
                    ข้อมูลส่วนตัวของท่านจะได้รับ
                    ความปลอดภัยอย่างสูงสุดในการทำธุรกรรมใดๆบนเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา ดังนั้น ข้อมูลต่างๆ
                    ของท่านที่ให้ไว้ผ่านเว็บแอปพลิเคชัน
                    จะถูกนำไปใช้ตามวัตถุประสงค์ของกิจกรรม
                    ลูกค้าสัมพันธ์ของผู้สนับสนุนเท่านั้น ผู้สนับสนุน
                    จะดำเนินการตามมาตรฐานที่เข้มงวดในการรักษา ความปลอดภัย
                    ตลอดจนป้องกันไม่ให้มีการนำข้อมูลไปใช้โดยไม่ได้รับอนุญาตจากท่านก่อน
                    นโยบายความเป็นส่วนตัวตามที่ปรากฎด้านล่างนี้
                    ใช้บังคับกับบัญชีผู้ใช้งานและข้อมูลต่างๆ ของท่าน
                    เพื่อให้ท่านทราบอย่างชัดเจนว่า ผู้สนับสนุน
                    ใช้ข้อมูลของท่านอย่างไรและวิธีการที่ท่านสามารถใช้
                    เพื่อปกป้องข้อมูลส่วนบุคคลของท่าน
                    ตามที่ท่านได้ให้ไว้ผ่านเว็บแอปพลิเคชันคูลคูลเฟรช
                    บิ๊กอั่งเปานี้
                  </p>
                  <p>5.1 การเก็บรวบรวมข้อมูลส่วนบุคคล</p>
                  <p>
                    ระบบจะเก็บรวบรวมข้อมูลของท่านเพื่อการให้บริการที่ดีขึ้นแก่ผู้ใช้งานเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา
                    และเพื่อความสะดวกหรือเพื่อประโยชน์ในการใช้งานกับท่านมากที่สุด
                    ระบบได้รวบรวมข้อมูล ของท่านโดยใช้วิธีดังต่อไปนี้
                  </p>
                  <p>5.1.1 ข้อมูลที่ท่านให้เรา</p>
                  <p>
                    เพื่อความสะดวกแก่ผู้ใช้งานทุกราย
                    ผู้สนับสนุนจำเป็นต้องให้ผู้ที่ลงทะเบียนร่วมกิจกรรม
                    คูลคูลเฟรช บิ๊กอั่งเปา
                    ต้องกรอกข้อมูลส่วนบุคคลที่จำเป็นลงในเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา อันได้แก่ ชื่อ-นามสกุล อีเมล์ เพศ
                    วันเดือนปีเกิด และ หมายเลขโทรศัพท์ เป็นต้น
                    ในกรณีที่ผู้ใช้งานใช้สิทธิ์
                    ลุ้นรับรางวัลภายใต้แคมเปญต่างๆของ คูลคูลเฟรช บิ๊กอั่งเปา
                    ผู้ใช้งานจะต้องยินยอมแจ้งข้อมูลส่วนตัว
                    ที่ผู้สนับสนุนร้องขอเพิ่มเติม
                    หากผู้ใช้งานให้ข้อมูลตามที่ผู้สนับสนุนร้องขอไม่ครบถ้วน
                    ผู้สนับสนุนขอสงวนสิทธิ์ในการจัดรับรางวัลดังกล่าวโดยไม่มีข้อยกเว้นใดๆ
                  </p>
                  <p>5.1.2 ข้อมูลอุปกรณ์</p>
                  <p>
                    ระบบจะรวบรวมข้อมูลเฉพาะของอุปกรณ์พกพา (Mobile Device) และ
                    computer, Notebook ที่ผู้ใช้งานใช้สมัครสมาชิกในครั้งแรกด้วย
                    เช่น รุ่นฮาร์ดแวร์ รุ่นระบบปฏิบัติการ ข้อมูลเครือข่าย เลข
                    IMEI เป็นต้น
                  </p>
                  <p>5.1.3 ข้อมูลประวัติการใช้งาน</p>
                  <p>
                    เมื่อผู้ใช้งานทำกิจกรรมใดๆ เช่น
                    ส่งรูปภาพใบเสร็จบนเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    ระบบจะรวบรวมและจัดเก็บข้อมูลการใช้งานไว้อัตโนมัติ เช่น
                    ข้อมูลที่ท่านค้นหา รายละเอียด การอัพโหลดภาพใบเสร็จ
                    และประวัติการส่ง เป็นต้น
                  </p>
                  <p>5.1.4 ข้อมูลตำแหน่ง</p>
                  <p>
                    ระบบอาจรวบรวมและประมวลผลข้อมูลตำแหน่งที่อยู่ของผู้ใช้งาน
                    โดยใช้เทคโนโลยีระบุตำแหน่ง
                    เพื่อใช้เป็นข้อมูลในการนำเสนอกิจกรรม หรือแคมเปญใดๆ
                    ของผู้สนับสนุน
                  </p>
                  <p>5.1.5 พื้นที่เก็บข้อมูลในตัวเครื่อง</p>
                  <p>
                    ระบบอาจรวบรวมและจัดเก็บข้อมูลส่วนตัว และข้อมูลการใช้งานอื่นๆ
                    ของผู้ใช้งาน โดยใช้พื้นที่จัดเก็บ ข้อมูลเว็บเบราว์เซอร์
                    (รวมถึง HTML 5) และแคชข้อมูลของเว็บแอปพลิเคชัน
                  </p>
                  <p>5.1.6 คุกกี้ (Cookies) และ แคชไฟล์ (Cache File)</p>
                  <p>
                    “คุกกี้” คือไฟล์ข้อมูลเล็กๆ
                    ที่ถูกส่งไปยังเครื่องอุปกรณ์พกพาของผู้ใช้งาน
                    เพื่อเป็นการอนุญาต ให้เว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    บันทึกข้อมูลเกี่ยวกับท่านในฐานะผู้ใช้งานของคูลคูลเฟรช
                    บิ๊กอั่งเปา
                    เมื่อท่านได้กลับเข้ามายังเว็บแอปพลิเคชันของคูลคูลเฟรช
                    บิ๊กอั่งเปา อีกครั้งโดยใช้โปรแกรม ท่องอินเตอร์เน็ท (Web
                    browser) และอุปกรณ์เครื่องเดิม ระบบจะส่ง “คุกกี้”
                    ไปยังอุปกรณ์ของท่าน
                    ก็ต่อเมื่อท่านสมัครสมาชิกเพื่อใช้งานบัญชีของท่านที่ได้สมัครไว้กับ
                    คูลคูลเฟรช บิ๊กอั่งเปา “คุกกี้”
                    เหล่านี้สามารถทำให้ระบบจดจำท่านในขณะที่ท่านเข้าใช้บริการในหน้าต่างๆ
                    ภายในเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    โดยไม่จำเป็นต้องระบุชื่อผู้ใช้งานและรหัสผ่านหลายครั้ง
                    และเมื่อท่านลงชื่อ ออกจากระบบ หรือปิดหน้า Web browser
                    “คุกกี้” เหล่านี้จะสิ้นผลลง
                  </p>
                  <p>
                    เว็บบราวเซอร์ (Web browser)
                    หรือโปรแกรมบนอุปกรณ์พกพาที่ท่านใช้เชื่อมต่อกับเว็บไซต์หรือ
                    ระบบอาจเก็บและบันทึก “Cache File”
                    รวมถึงข้อมูลส่วนบุคคลของท่านไว้ ซึ่งเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา ไม่มีส่วนในการควบคุมหรือเข้าถึง
                    “Cache File” ดังกล่าวแต่อย่างใด
                  </p>
                  <p>5.2 วิธีการใช้ข้อมูลของผู้ใช้งาน</p>
                  <p>
                    5.2.1
                    ผู้สนับสนุนจะใช้ข้อมูลส่วนตัวของผู้ใช้งานเท่าที่จำเป็นในการติดต่อ
                    ให้บริการ สำรวจความคิดเห็น ประชาสัมพันธ์
                    หรือให้ข้อมูลข่าวสารต่างๆ ที่เป็นประโยชน์กับผู้ใช้งาน
                    รวมไปถึงการนำข้อมูลไปใช้
                    ในการวิเคราะห์เชิงสถิติเพื่อปรับปรุง
                    การทำกิจกรรมการตลาดในรูปแบบต่างๆ หรือกิจกรรมอื่น
                    ที่อยู่ภายใต้การดูแลของผู้สนับสนุนให้ดียิ่งขึ้น
                  </p>
                  <p>
                    5.2.2 ผู้ใช้งานมีสิทธิในความเป็นส่วนตัวของข้อมูลของท่าน
                    โดยผู้สนับสนุนจะไม่อนุญาตให้มีการเปิดเผย
                    ข้อมูลเกี่ยวกับบัญชีผู้สมัครลงทะเบียนร่วมกิจกรรมคูลคูลเฟรช
                    บิ๊กอั่งเปา ของท่านให้กับบุคคลภายนอก
                    นอกเหนือจากการได้รับอนุญาตจากผู้ใช้งานเท่านั้น
                  </p>
                  <p>
                    5.2.3
                    ผู้สนับสนุนจะไม่นำข้อมูลส่วนตัวของผู้ใช้งานที่ให้ไว้บนเว็บแอปพลิเคชันคูลคูลเฟรช
                    บิ๊กอั่งเปา ไปขายหรือเผยแพร่ให้กับบุคคลภายนอกโดยเด็ดขาด
                    เว้นแต่จะได้รับอนุญาตจากผู้ใช้งานเท่านั้น
                  </p>
                  <p>
                    5.2.4 เว็บแอปพลิเคชันอาจมีโฆษณาที่เชื่อมต่อ (Link)
                    ไปยังเว็บไซต์อื่น ๆ ซึ่งอาจมีมาตรการหรือ
                    นโยบายเกี่ยวกับการคุ้มครองความเป็นส่วนตัวที่แตกต่างจากเว็บแอปพลิเคชันคูลคูลเฟรช
                    บิ๊กอั่งเปา นี้
                    ท่านต้องตรวจสอบนโยบายความเป็นส่วนตัวของเว็บไซต์อื่นที่เชื่อมโยงนี้ด้วย
                    ผู้สนับสนุนไม่สามารถรับรองข้อความ
                    หรือการดำเนินการตามที่ได้มีการประกาศไว้ในเว็บไซต์อื่นได้
                    และจะไม่รับผิดชอบใดๆ
                    หากเว็บไซต์เหล่านั้นไม่ได้ปฏิบัติการหรือดำเนินการใดๆ
                    ตามนโยบายความเป็นส่วนตัวที่ได้ประกาศไว้
                  </p>
                  <p>
                    5.2.5 เมื่อผู้ใช้งานติดต่อขอความช่วยเหลือผ่านทาง
                    เว็บแอปพลิเคชันคูลคูลเฟรช บิ๊กอั่งเปา ระบบ
                    จะเก็บบันทึกการติดต่อของท่าน เพื่อช่วยแก้ปัญหาใดๆ
                    ตามที่ตรวจพบ และอาจใช้ที่อยู่อีเมลของท่าน
                    เพื่อแจ้งให้ท่านทราบถึงการแก้ปัญหาที่เกิดขึ้น หรือ
                    แจ้งให้ทราบเกี่ยวกับการเปลี่ยนแปลง หรือ การปรับปรุงใดๆ
                    ไว้ล่วงหน้า
                  </p>
                  <p>
                    5.2.6 ในระบบเว็บแอปพลิเคชันคูลคูลเฟรช บิ๊กอั่งเปา
                    จะขอความยินยอมจากท่านก่อนใช้ข้อมูล เพื่อจุดประสงค์อื่นๆ
                    นอกเหนือจากที่ระบุไว้ในนโยบายความเป็นส่วนตัวนี้
                  </p>
                  <p>5.3 การเข้าถึงและเปลี่ยนแปลงข้อมูลส่วนตัว</p>
                  <p>
                    5.3.1
                    ผู้สนับสนุนอาจปฏิเสธคำขอซ้ำซ้อนอันเกินควรหรือต้องใช้ความพยายามทางเทคนิคมากเกินไป
                    เช่น การพัฒนาระบบใหม่หรือเปลี่ยนหลักปฏิบัติพื้นฐานที่มีอยู่
                    เสี่ยงต่อข้อมูลส่วนบุคคลของผู้อื่น
                    หรือไม่สามารถปฏิบัติได้จริง เช่น
                    คำขอเกี่ยวกับข้อมูลที่อยู่ในระบบสำรอง
                  </p>
                  <p>
                    5.3.2 เมื่อบัญชี คูลคูลเฟรช บิ๊กอั่งเปา ของท่านถูกปิดแล้ว
                    ระบบจะยังคงเก็บข้อมูลบัญชีของท่าน ไว้ในฐานข้อมูลของ
                    คูลคูลเฟรช บิ๊กอั่งเปา ต่อไปตามที่กฎหมายกำหนด
                    เพื่อวัตถุประสงค์ในการตรวจสอบ กรณีทุจริต
                    และเป็นการป้องกันการปิดบัญชีเพื่อหลีกเลี่ยงการทุจริตโดยการปิดบัญชีเก่าและเปิดบัญชีใหม่
                    อย่างไรก็ตาม เมื่อบัญชีของท่านถูกปิดแล้ว
                    ผู้สนับสนุนจะไม่ใช้ข้อมูลของท่านอีกต่อไป รวมทั้ง
                    จะไม่เปิดเผยข้อมูลของท่านให้แก่บุคคลอื่น
                    ยกเว้นกรณีที่ใช้ในกระบวนการทางกฎหมายเท่านั้น
                  </p>
                  <p>5.4 การแบ่งปันข้อมูล</p>
                  <p>
                    5.4.1
                    ผู้สนับสนุนจะไม่แบ่งปันข้อมูลส่วนตัวของผู้ใช้งานกับบริษัท
                    องค์กร และบุคคลภายนอก ยกเว้นในกรณีดังต่อไปนี้
                  </p>
                  <p>(1) เมื่อได้รับความยินยอมจากท่าน</p>
                  <p>(2) สำหรับเหตุผลทางกฎหมาย</p>
                  <p>
                    5.4.2 ผู้สนับสนุนจะแบ่งปันข้อมูลส่วนตัวของผู้ใช้ให้กับบริษัท
                    องค์กร หรือบุคคลภายนอก หากผู้สนับสนุน
                    เชื่อโดยสุจริตว่าการเข้าถึง เข้าใช้ การเก็บรักษา
                    หรือการเปิดเผยข้อมูลนั้นมีเหตุจำเป็นอันสมควรดังนี้
                  </p>
                  <p>
                    (ก) เป็นไปตามกฎหมายที่เกี่ยวข้อง ระเบียบข้อบังคับ
                    กระบวนการทางกฎหมาย หรือการร้องขอข้อมูล จากทางราชการ
                  </p>
                  <p>
                    (ข) บังคับใช้ข้อกำหนดในการให้บริการที่เกี่ยวข้อง
                    รวมถึงการตรวจสอบการละเมิดที่อาจเกิดขึ้น
                  </p>
                  <p>
                    (ค) ตรวจจับ ป้องกัน หรือระบุการทุจริต
                    ปัญหาด้านความปลอดภัยหรือด้านเทคนิค
                  </p>
                  <p>
                    (ง) ป้องกันอันตรายต่อสิทธิ ทรัพย์สิน
                    หรือความปลอดภัยผู้ใช้งานคนอื่นๆที่ใช้งานเว็บแอปพลิเคชัน
                    หรือประชาชนตามที่กฎหมายกำหนดหรืออนุญาต
                  </p>
                  <p>5.5 การปรับปรุงนโยบายความเป็นส่วนตัว</p>
                  <p>
                    ผู้สนับสนุนอาจทำการปรับปรุงหรือแก้ไขนโยบายความเป็นส่วนตัวเป็นระยะ
                    แต่จะไม่ลดทอนสิทธิ ของท่านภายใต้นโยบายความเป็นส่วนตัวนี้
                    และจะเผยแพร่การเปลี่ยนแปลงเกี่ยวกับนโยบายส่วนตัว
                    ในเว็บแอปพลิเคชันนี้ และหากมีการเปลี่ยนแปลงสำคัญ
                    ผู้สนับสนุนจะแจ้งให้ทราบล่วงหน้าอย่างชัดเจน
                    ขอแนะนำให้ท่านอ่านนโยบายความเป็นส่วนตัวทุกครั้งที่เข้าชมหรือใช้หรือแลกรับรางวัล
                  </p>
                  <p>6. การใช้เว็บไซต์และโปรแกรม</p>
                  <p>
                    6.1
                    ผู้สนับสนุนจะใช้ความพยายามตามสมควรในการที่จะแก้ไขข้อผิดพลาดหรือข้อตกหล่นต่างๆ
                    ให้เร็วที่สุดหลังจากได้รับการแจ้งถึงข้อผิดพลาดนั้นๆ
                    อย่างไรก็ตามผู้สนับสนุนไม่รับประกันว่า
                    เว็บแอปพลิเคชันจะปราศจากข้อผิดพลาดและ
                    จะไม่รับผิดชอบในความผิดพลาด รวมถึงการสูญหาย
                    ของสิทธิ์ในการลุ้นรางวัลที่ผู้ใช้งานใช้งานสะสม
                  </p>
                  <p>
                    6.2
                    ผู้สนับสนุนไม่รับประกันว่าโปรแกรมเว็บแอปพลิเคชันจะปราศจากไวรัสคอมพิวเตอร์หรือสิ่งอื่นใด
                    ที่อาจส่งผลอันตรายต่ออุปกรณ์พกพาของผู้ใช้งาน
                  </p>
                  <p>
                    6.3
                    การเข้าถึงเว็บแอปพลิเคชันอาจถูกจำกัดในบางครั้งด้วยเหตุผลในการซ่อมบำรุง
                    ซ่อมแซม หรือ เพิ่มอุปกรณ์หรือบริการใหม่
                    ผู้สนับสนุนจะใช้ความพยายามในการที่จะทำให้การเข้าถึงเว็บแอปพลิเคชัน
                    ดังกล่าวกลับมาใช้งานได้ดังเดิมโดยเร็วที่สุด
                    ทั้งนี้คูลคูลเฟรช บิ๊กอั่งเปา จะไม่รับผิดชอบในระบบ
                    การทำงานที่ขึ้นอยู่กับบราวเซอร์หรือโปรแกรมอื่นของบุคคลภายนอก
                  </p>
                  <p>
                    6.4 ผู้สนับสนุนขอสงวนสิทธิ์ที่จะปิดกั้นการเข้าถึง และ/หรือ
                    แก้ไขหรือลบสิ่งใดๆ ที่เห็นว่าอาจเป็นเหตุ
                    ให้มีการผิดเงื่อนไขและข้อกำหนดของสัญญานี้
                  </p>
                  <p>
                    6.5 การใช้ข้อมูลหรือสื่อใดๆ
                    บนเว็บไซต์หรือโปรแกรมโดยผู้ใช้งานเป็นความเสี่ยงและเป็นความรับผิดชอบ
                    ของผู้ใช้งานเองทั้งสิ้น
                  </p>
                  <p>
                    6.6 ผู้ใช้งานสามารถเข้าถึง เว็บแอปพลิเคชันคูลคูลเฟรช
                    บิ๊กอั่งเปา ได้ที่ลิงค์
                    https://koolkoolfreshcampaign2024.com หรือที่ Facebook :
                    คูลคูลเฟรช https://www.facebook.com/KoolKoolFreshHerbalDrink
                    หรือจากช่องทางอื่นที่ผู้สนับสนุนได้มีการประชาสัมพันธ์เอาไว้
                    ทั้งนี้ผู้สนับสนุนจะไม่รับผิดชอบต่อ ความเสียหาย
                    หรือความผิดปกติของอุปกรณ์พกพาของผู้ใช้งานอันเป็นผลมาจากการติดตั้งโปรแกรม
                    ลงบนอุปกรณ์พกพาของผู้ใช้งาน
                  </p>

                  <p>7. การโฆษณา</p>
                  <p>
                    7.1
                    ผู้สนับสนุนอาจแสดงสื่อโฆษณาในตำแหน่งต่างๆบนเว็บแอปพลิเคชัน
                    ในระหว่างที่ผู้ใช้งานใช้บริการ
                  </p>
                  <p>
                    7.2
                    ผู้ใช้งานสามารถเลือกหรือกดเพื่อเข้าชมบริการที่มีการโฆษณาหรือไม่ก็ได้โดยอิสระตามแต่ที่
                    ผู้ใช้งานจะพิจารณา
                  </p>
                  <p>
                    7.3 จะไม่มีการใช้ข้อมูลส่วนตัว (เช่น ชื่อ-นามสกุล ที่อยู่
                    อีเมล์ หรือหมายเลขโทรศัพท์) ในการแสดง ข้อความโฆษณา
                    แต่ทั้งนี้
                    ผู้ลงโฆษณาที่เป็นบุคคลที่สามหรือบริษัทในเครืออาจะติดตั้งหรือจดจำ
                    "cookie" บนเว็บบราวเซอร์ของผู้ใช้งาน
                    (กรุณาดูในนโยบายความเป็นส่วนตัว) โดย "cookie" นี้
                    จะไม่เก็บข้อมูลส่วนตัวของผู้ใช้งาน
                    หรือลิงค์เชื่อมต่อไปยังข้อมูลส่วนตัวของผู้ใช้งาน
                    หากผู้ใช้งาน
                    ต้องการข้อมูลเพิ่มเติมเกี่ยวกับวิธีปฏิบัติดังกล่าวและเลือกที่จะไม่ให้ใช้ข้อมูลดังกล่าวโดยบริษัทใดๆ
                    กรุณาดูในนโยบายความเป็นส่วนตัวเกี่ยวกับเรื่องดังกล่าว
                  </p>
                  <p>8. การชดเชยและชดใช้ค่าเสียหาย</p>
                  <p>
                    ผู้ใช้งานตกลงที่จะชดใช้ความเสียหายให้แก่ผู้สนับสนุนสำหรับบรรดาความสูญเสีย
                    ค่าเสียหาย และ/ หรือค่าใช้จ่ายทั้งปวง
                    อันเป็นผลมาจากการที่ผู้ใช้งานละเมิดหรือผิดเงื่อนไขข้อใดๆ
                    ในสัญญานี้
                  </p>
                  <p>9. เหตุสุดวิสัย</p>
                  <p>
                    ผู้สนับสนุนไม่ต้องรับผิดในความล่าช้าหรือการไม่ปฏิบัติตามสัญญาเพราะสุดวิสัย
                    อัคคีภัย อุทกภัย อุบัติเหตุ การจราจล สงคราม การแทรกแซงของรัฐ
                    การนัดหยุดงาน ปัญหาด้านแรงงาน ความบกพร่อง ของอุปกรณ์
                    หรือเหตุอื่นใดที่อยู่นอกเหนือการควบคุมของผู้สนับสนุน
                  </p>
                  <p>
                    10.
                    การไม่รับประกันข้อยกเว้นความรับผิดและการปลดเปลื้องจากความรับผิด
                  </p>
                  <p>10.1 การไม่รับประกัน</p>
                  <p>
                    (1) เว้นแต่กฎหมายจะบัญญัติไว้โดยเฉพาะคูลคูลเฟรช บิ๊กอั่งเปา
                    ไม่มีความสัมพันธ์พิเศษหรือหน้าที่
                    เกี่ยวกับความซื่อสัตย์ต่อผู้ใช้งาน ผู้ใช้งานรับทราบว่า
                    คูลคูลเฟรช บิ๊กอั่งเปา ไม่มีอำนาจในการควบคุม
                    หรือหน้าที่ในการปฏิบัติเกี่ยวกับว่าผู้ใช้งานรายใดจะเข้าใช้บริการ
                    หรือเนื้อหาใดที่ผู้ใช้งานจะได้รับ จากการใช้บริการ
                    หรือผลกระทบของเนื้อหาที่มีต่อผู้ใช้งาน
                    หรือการดำเนินการใดที่ผู้ใช้งานจะปฏิบัติ
                    อันเป็นผลมาจากการได้รับเนื้อหาดังกล่าว
                  </p>
                  <p>
                    (2)
                    บริการอาจประกอบไปด้วยหรือเชื่อมโยงผู้ใช้งานไปยังเว็บไซต์อื่นที่มีข้อมูลที่บุคคลบางคน
                    รู้สึกไม่พอใจหรือเห็นว่าไม่เหมาะสม ดังนั้นคูลคูลเฟรช
                    บิ๊กอั่งเปา จึงไม่อาจรับรองถึงรายละเอียด ของเนื้อหาใดๆ
                    ที่ปรากฏหรือสามารถเข้าถึงได้โดยการใช้บริการ และ คูลคูลเฟรช
                    บิ๊กอั่งเปา จะไม่รับผิดชอบหรือรับผิดต่อความถูกต้อง
                    การร้องเรียนเกี่ยวกับลิขสิทธิ์ ความชอบด้วยกฎหมาย
                    หรือความเหมาะสมของเนื้อหาที่แสดงหรือเข้าถึงได้โดยผ่านการใช้บริการ
                  </p>
                  <p>
                    (3) เว็บแอปพลิเคชันและการบริการตลอดจนเนื้อหาต่างๆ
                    ดังกล่าวเป็นการจัดให้มี "ตามสภาพ" และ "ตามที่ปรากฏ"
                    โดยปราศจากคำรับรองหรือรับประกันไม่ว่าในลักษณะใดๆ
                    และไม่ว่าโดยตรง หรือโดยปริยาย
                  </p>
                  <p>
                    (4) เว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา ตลอดจนกรรมการ
                    ผู้ถือหุ้น พนักงาน ตัวแทน ผู้แทน หุ้นส่วน ไม่รับประกันว่า
                  </p>
                  <p>(ก) บริการจะปลอดภัยและสามารถใช้งานได้ทุกที่หรือทุกเวลา</p>
                  <p>(ข) บรรดาความบกพร่องจะได้รับการแก้ไขให้ถูกต้อง</p>
                  <p>(ค) ผู้ใช้งานจะพึงพอใจผลการใช้บริการตามที่คาดหวังไว้</p>
                  <p>
                    (ง) ผู้ใช้งานจะได้รับรางวัลจากผู้สนับสนุน หรือหากได้รับ
                    รางวัลดังกล่าวจะมีสี คุณภาพ จำนวน
                    หรือคุณสมบัติตรงตามที่ผู้สนับสนุนแสดงหรือประกาศไว้ในแคมเปญ
                    ผู้ใช้งานเป็นผู้รับความเสี่ยงภัย จากการใช้งานเว็บไซต์
                    โปรแกรม บริการ ระบบและเนื้อหาเองแต่เพียงผู้เดียว
                  </p>
                  <p>10.2 ข้อยกเว้นความรับผิด</p>
                  <p>
                    เว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    จะไม่รับผิดชอบต่อการสูญหายของสิทธิ์ การสูญเสียรายได้ กำไร
                    สัญญา ชื่อเสียง ธุรกิจ โอกาส
                    หรือความเสียหายใดๆอันเนื่องมากจากความผิดพลาดของข้อมูล
                    ไม่ว่าจะเป็นผลมาจากการทำละเมิด การผิดสัญญาหรือไม่ก็ตาม
                  </p>
                  <p>10.3 การปลดเปลื้องจากความรับผิด</p>
                  <p>
                    ผู้ใช้งานตกลงแบบเพิกถอนไม่ได้ในการปลดเปลื้องผู้สนับสนุนจากบรรดาความรับผิดหรือความเสียหาย
                    ทั้งหมดทั้งปวงที่เกิดขึ้นกับผู้ใช้งานอันเป็นผลมาจากการใช้บริการบนเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา นี้
                  </p>
                  <p>11. หน้าที่ของผู้ใช้งาน</p>
                  <p>
                    11.1
                    ผู้สนับสนุนอาจกำหนดข้อตกลงและเงื่อนไขเกี่ยวกับแคมเปญของผู้สนับสนุนเอง
                    และผู้ใช้งาน
                    ตกลงที่จะยอมรับและผูกพันตามข้อตกลงและเงื่อนไขดังกล่าว
                  </p>
                  <p>
                    11.2
                    ผู้ใช้งานรับรองว่าบรรดาข้อมูลที่ให้ไว้ในการสมัครสมาชิกบัญชี
                    คูลคูลเฟรช บิ๊กอั่งเปา
                    ภายใต้ข้อตกลงและเงื่อนไขนี้เป็นข้อมูลที่แท้จริง
                    ครบถ้วนและถูกต้อง และผู้ใช้งานจะแก้ไขในทันที
                    ที่มีการเปลี่ยนแปลงข้อมูลดังกล่าวเพื่อทำให้ข้อมูลเกี่ยวกับบัญชีของผู้ใช้งานเป็นปัจจุบัน
                  </p>
                  <p>
                    11.3
                    ผู้ใช้งานตกลงที่จะไม่ใช้หรืออนุญาตให้บุคคลอื่นใช้งานบนเว็บแอปพลิเคชัน
                    คูลคูลเฟรช บิ๊กอั่งเปา โดยไม่จำกัดแต่เพียงในกรณีดังต่อไปนี้
                  </p>
                  <p>
                    (1) ส่งหรือรับสื่อที่มีลักษณะเป็นการข่มขู่ ก้าวร้าว หยาบคาย
                    ลามก คุกคาม ดูหมิ่นเหยียดหยาม หรือหมิ่นประมาทบุคคลใดๆ
                    ดูหมิ่นหรือละเมิดอำนาจศาล ลิขสิทธิ์ สิทธิของบุคคล การเผยแพร่
                    หรือความเป็นส่วนตัว หรือสิทธิของบุคคลอื่น
                  </p>
                  <p>
                    (2)
                    ส่งหรือรับสื่อที่ผู้ใช้งานไม่ได้รับอนุญาตหรือได้รับความยินยอม
                    ซึ่งอาจก่อให้เกิดหรือยุยงให้เกิด การกระผิดทางอาญา
                    หรือความผิดในทางแพ่ง หรือไม่ว่าในลักษณะใดๆ
                    ที่เป็นการขัดต่อกฎหมาย
                    หรือละเมิดสิทธิของบุคคลอื่นไม่ว่าจะอยู่ในประเทศใดในโลก
                  </p>
                  <p>
                    (3) ส่งหรือรับสื่อใดๆ ที่เป็นอันตรายในทางเทคนิค
                    (รวมถึงไวรัสคอมพิวเตอร์ logic bombs, Trojan horses, worms,
                    ส่วนประกอบที่เป็นอันตราย ข้อมูลที่บกพร่อง
                    หรือซอฟท์แวร์ที่มีเจตนามุ่งร้ายหรือข้อมูล ที่เป็นอันตราย)
                  </p>
                  <p>
                    (4) ก่อให้เกิดความรำคาญ ไม่สะดวกสบาย
                    หรือก่อให้เกิดความกังวลโดยไม่มีเหตุอันสมควร
                  </p>
                  <p>
                    (5)
                    สกัดกั้นหรือพยายามสกัดกั้นการส่งผ่านข้อมูลสำหรับการสื่อสารโดยระบบโทรคมนาคม
                  </p>
                  <p>
                    (6)
                    เพื่อประโยชน์อื่นนอกเหนือจากวัตถุประสงค์ที่ออกแบบมาหรือวัตถุประสงค์การใช้งาน
                  </p>
                  <p>(7) เพื่อวัตถุประสงค์ในการฉ้อโกง</p>
                  <p>
                    (8)
                    ไม่เป็นไปตามหรือสอดคล้องกับวิธีปฏิบัติเกี่ยวกับอินเตอร์เน็ทหรือการเชื่อต่อเน็ทเวิร์คอันเป็นที่
                    ยอมรับ
                  </p>
                  <p>
                    (9) การกระทำใดๆ ที่เป็นการก่อให้เกิดความเกลียดชังในเชื้อชาติ
                    ศาสนา หรือคนกลุ่มน้อย
                    หรืออันเป็นการทำให้เกิดผลอย่างมีนัยสำคัญต่อบุคคล กลุ่มบุคคล
                    หรือเอกลักษณ์
                  </p>
                  <p>
                    11.4 การใช้บริการดังต่อไปนี้
                    เป็นการกระทำที่ต้องห้ามโดยชัดแจ้งและผู้ใช้งานตกลงที่จะไม่กระทำการ
                    ดังกล่าว (หรือยินยอมให้บุคคลอื่นกระทำการดังกล่าว)
                  </p>
                  <p>
                    (1)
                    ความพยายามในการหลีกเลี่ยงระบบความปลอดภัยหรือเครือข่ายรวมถึงการเข้าถึงข้อมูลที่มิได้
                    มีไว้สำหรับผู้ใช้งาน การถึงเครื่องบริการ (Server)
                    หรือบัญชีที่ผู้ใช้งานไม่ได้รับอนุญาตโดยชัดแจ้ง ให้เข้าถึงได้
                    หรือการแทรกแซงระบบความปลอดภัยของระบบเครือข่ายอื่น (เช่น
                    running a port scan)
                  </p>
                  <p>
                    (2)
                    การกระทำใดเพื่อตรวจดูเครือข่ายซึ่งจะสกัดกั้นข้อมูลที่ไม่ได้มีไว้สำหรับผู้ใช้งาน
                  </p>
                  <p>
                    (3)
                    ดำเนินการอันเป็นการกระทำที่ผิดกฎหมายเกี่ยวกับการใช้เว็บแอปพลิเคชัน
                    และ/หรือ บริการ
                  </p>
                  <p>
                    (4) ดำเนินการในลักษณะใดๆ
                    (ตามความเห็นของผู้สนับสนุนแต่เพียงผู้เดียว)
                    ที่เป็นการจำกัดหรือ
                    ขัดขวางผู้ใช้งานรายอื่นจากการใช้งานหรือเพลิดเพลินกับการใช้งานเว็บแอปพลิเคชันและบริการ
                  </p>
                  <p>
                    (5) ส่งข้อความใดๆ
                    ในทางที่จะทำให้บุคคลอื่นเชื่อว่าหรือเข้าใจว่าข้อความดังกล่าวได้ถูกส่งหรือ
                    เปิดเผยโดยความสนับสนุนหรือความยินยอมของผู้สนับสนุน
                  </p>
                  <p>12. เบ็ดเตล็ด</p>
                  <p>12.1 หัวข้อต่างๆ</p>
                  <p>
                    หัวข้อต่างๆ
                    ที่ใช้ในสัญญานี้มีไว้เพื่อความสะดวกในการอ้างถึงเท่านั้นและไม่ถือเป็นส่วนหนึ่งของ
                    ข้อกำหนดและเงื่อนไขนี้ และไม่มีผลต่อการตีความสัญญา
                  </p>
                  <p>12.2 ความไม่เป็นหุ้นส่วนและตัวแทน</p>
                  <p>
                    ไม่มีข้อความใดๆ
                    ในสัญญานี้สามารถตีความได้ว่าผู้ใช้งานและผู้สนับสนุนมีการร่วมทุน
                    เข้าเป็นหุ้นส่วน
                    บริษัทหรือมีความสัมพันธ์เป็นตัวการและตัวแทนในรูปแบบใดๆ
                    โดยผู้สนับสนุน และผู้ใช้งานไม่มีอำนาจที่จะกระทำการใดๆ
                    แทนอีกฝ่ายในการที่จะก่อให้เกิดความรับผิดในหนี้ ค่าใช้จ่าย
                    เข้าเป็นคู่สัญญาหรือการใดๆ แทนกัน
                  </p>
                  <p>12.3 กฎหมายที่บังคับใช้</p>
                  <p>
                    ข้อกำหนดและเงื่อนไขนี้อยู่ภายใต้บังคับและการตีความของกฎหมายแห่งราชอาณาจักรไทย
                    โดยคู่สัญญา
                    ทั้งสองฝ่ายตกลงให้ศาลไทยเป็นผู้มีอำนาจในการชี้ขาดประเด็นข้อพิพาททั้งปวง
                  </p>
                  <p>12.4 ทรัพย์สิทธิ</p>
                  <p>
                    เนื้อหาที่อยู่บนเว็บแอปพลิเคชันรวมถึงข้อมูล
                    โปรแกรมคอมพิวเตอร์ รูปภาพ กราฟ วีดีโอ หน้าตัวพิมพ์ กราฟิก
                    ดนตรี เสียงหรือสิ่งอื่นๆ (เรียกรวมกันว่า "เนื้อหา")
                    ได้รับความคุ้มครองจากลิขสิทธิ เครื่องหมายการค้า สิทธิบัตร
                    หรือทรัพยสิทธิอื่น
                    โดยเนื้อหาทั้งหมดถือเป็นลิขสิทธิ์ของผู้สนับสนุน
                    ภายใต้กฎหมายลิขสิทธิ์ของประเทศไทย
                    ผู้ใช้งานไม่สามารถที่จะทำซ้ำ ดัดแปลง ลบทิ้ง เพิ่มเติม
                    เผยแพร่ ส่งต่อ หรือมีส่วนร่วมในการโอน หรือขาย
                    ให้เช่าซื้อหรือเช่า หรือนำไปดัดแปลงเป็นผลงานอื่น
                    ไม่ว่าส่วนหนึ่งส่วนใดหรือทั้งหมดเว้นแต่จะได้รับอนุญาตโดยชัดแจ้งจากผู้มีอำนาจให้ความยินยอม
                  </p>
                  <p>12.5 สิทธิของบุคคลภายนอก</p>
                  <p>
                    ข้อกำหนดทั้งหมดของสัญญานี้ใช้และให้ประโยชน์กับบริษัท โมบาย
                    คอนเน็ค จำกัด บริษัทในเครือสังกัด
                    และบริษัทที่ถือหุ้นในบริษัท โมบาย คอนเน็ค จำกัด (หรือ)
                    บริษัทในเครือและบุคคลภายนอกที่เป็น
                    ผู้จัดทำและได้รับอนุญาตโดยเท่าเทียมกัน
                    โดยบุคคลและองค์กรที่กล่าวมานี้มีสิทธิในการใช้สิทธิ
                    และบังคับใช้สิทธิตามข้อกำหนดของสัญญานี้โดยตรงหรือผ่านทางตัวแทน
                    (เว้นแต่สัญญานี้ได้ถูก
                    เปลี่ยนแปลงหรือยกเลิกโดยไม่ได้รับความยินยอมจากบุคคลหรือองค์กรดังกล่าว)
                    นอกจากที่ได้กล่าวมา
                    ข้างต้นสัญญานี้ไม่มีผลผูกพันหรือให้สิทธิในการบังคับตามสัญญากับบุคคลอื่นที่ไม่ใช่คู่สัญญา
                  </p>
                  <p>
                    12.6 การจัดทำเว็บแอปพลิเคชัน คูลคูลเฟรช บิ๊กอั่งเปา
                    ทั้งนี้ทางผู้สนับสนุน บริษัท ทวีผลผลิตภัณฑ์ จำกัด เลขที่ 101
                    ถนนชักพระ แขวงคลองชักพระ เขตตลิ่งชัน กรุงเทพฯ 10170
                    ไม่มีส่วนเกี่ยวข้อง ในการรับผิดชอบกรณีมีข้อผิดพลาดใดๆ
                    ทั้งสิ้นที่เกิดขึ้นจากผู้รับจ้างตามด้านล่าง
                  </p>
                  <p>
                    บริษัท โมบาย คอนเน็ค จำกัด จำกัด
                    เป็นเจ้าของและผู้ดำเนินการเขียนโปรแกรมระบบ และบริการ
                    ของเว็บแอปพลิเคชันคูลคูลเฟรช บิ๊กอั่งเปาขึ้น
                    ทั้งนี้เป็นนิติบุคคลที่จัดตั้งขึ้นและคงอยู่ตามกฎหมาย
                    ของประเทศไทย ที่ทำการอยู่ที่ บริษัท โมบาย คอนเน็ค จำกัด
                    ที่ทำการอยู่ที่ 1111/84 ถนนลาดพร้าว แขวงจันทรเกษม เขตจตุจักร
                    กรุงเทพมหานคร 10900 ประเทศไทย ทั้งนี้ทางผู้สนับสนุนไม่มีส่วน
                    เกี่ยวข้องในการรับผิดชอบกรณีมีข้อผิดพลาดใดๆทั้งสิ้นที่เกิดขึ้นจากการรับจ้างดังกล่าว
                  </p>
                  <p>12.7 ความมีผลของสัญญา</p>
                  <p>
                    ผู้ใช้งานและผู้สนับสนุน รวมถึงผู้รับจ้างเข้าทำสัญญานี้
                    (หรือข้อตกลงและเงื่อนไข) โดยระบบ อิเล็กทรอนิกส์
                    ซึ่งมีผลและใช้บังคับได้ตามพระราชบัญญัติว่าด้วยธุรกรรมทางอิเล็กทรอนิกส์
                    พุทธศักราช 2544
                    ด้วยเหตุนี้จึงจำต้องลงลายมือชื่อโดยการกดยอมรับเงือนไข
                  </p>
                </div>

        </Modal>
      ) : null}
    </>
  );
}
